[{"id":"NHFPM0FwU2gyUjVrWkJFMUFBQUFBQSUzRCUzRCUzQmdyZWVuJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Full Charge Bookkeeper","company":"Green, Polack &amp; Company Accountancy Corporation","description":"CPA Firm is seeking a full-charge Bookkeeper to join our team. The ideal candidate will be responsible for multiple client accounts, be able to assist clients with accounting issues, have some tax preparation experience, and enjoy working closely with clients regarding financial matters.\n\nDuties...\n\n- Ability to take client account information and make necessary adjustments to conform to accounting standards\n- Prepare financial statements and reports\n- Reconcile accounts\n- Process payroll and prepare payroll reports\n- Utilize QuickBooks software\n- Assist with income tax preparation\n- Meet weekly, monthly, quarterly, and annual deadlines as required\n\nSkills:\n\n- Proficiency in accounting principles\n- Knowledge of governmental compliance requirements\n- Working knowledge of bookkeeping software QuickBooks and tax preparation software Lacerte\n- Ability to handle payroll responsibilities\n- Proficiency with Microsoft Office applications\n\nThis position offers the opportunity to work in a close-knit environment with a flexible schedule. Pay will be dependent on experience and benefits are offered. An Associates Degree in Accounting or Business is preferred, and 2 years minimum accounting/bookkeeping experience is required","image":"","location":"Lodi, CA","employmentType":"Full-time","datePosted":"1 day ago","salaryRange":"22–28 an hour","jobProviders":[{"jobProvider":"ZipRecruiter","url":"https://www.ziprecruiter.com/c/Green,-Polack-&-Company-Accountancy-Corporation/Job/Full-Charge-Bookkeeper/-in-Lodi,CA?jid=32fb2833d22d843c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"BeBee","url":"https://us.bebee.com/job/0f72795c58bebbdef49fca814df8f07b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"TzFMWUp5Q2NpVFBJeGJSeUFBQUFBQSUzRCUzRCUzQmdyZWVuJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Pilot - Customs and Border Protection - Military veterans preferred","company":"U.S. Customs and Border Protection","description":"Air and Marine Operations (AMO), a component of U.S. Customs and Border Protection (CBP), offers skilled PILOTS interested in law enforcement an exceptional opportunity to work with an elite team of highly trained professionals whose camaraderie, pride, and purpose are hallmarks of their daily mission protecting America. If you are looking for an exciting and rewarding career with great pay... benefits, and job stability, now is the time to make your move: become an Air Interdiction Agent . AMO is actively recruiting for these full-time security-based opportunities with a streamlined application process. Notably, seasoned pilots with military training are in high demand– APPLY TODAY WAIVED: The “100 flight hours in the last 12 months” qualification requirement is waived through August 1, 2024. Salary and Benefits Begin your career as an Air Interdiction Agent (AIA) and make up to $104,000–125,000 per year based on your GS-11 grade level qualifications plus location and overtime pay. This career ladder position has a grade level progression of GS-11, GS-12, and GS-13. You may be eligible for a promotion to the next higher grade level automatically (without re-applying) once you complete 52-weeks at each grade level (with supervisor approval). Agents receive the full package of federal employment benefits that include health and insurance plans, a generous annual and sick leave program, and participation in the Thrift Savings Plan, a retirement plan akin to a traditional 401(k) offering. Duty Locations Locations are offered based on operational requirements, mission requirements, and critical agency hiring needs as determined by AMO. The duty location listed in a final offer letter may include any geographic location within the Southeast Border Region, Caribbean Air and Marine Branch (CAMB), Southwest Border Region, and National Air Security Operation Centers (NASOC) Unmanned Aircraft System (UAS) locations. You must be willing to work at any duty location within that region to include but not limited to the following: Southeast Region: Homestead, FL CAMB: Aguadilla, PR Southwest Region: Tucson and Yuma, AZ; San Diego, CA; El Paso, Laredo, and McAllen, TX NASOC UAS locations: Sierra Vista, AZ; San Angelo, TX AMO is currently seeking multi engine pilots for the following locations: Jacksonville, FL, Conroe, and Corpus Christi, TX, Hammond, LA, Aguadilla, PR. You may qualify for reimbursement of relocation expenses in accordance with agency policy. Duties and Responsibilities As an Air Interdiction Agent (AIA) you will perform aviation-based law enforcement operations for the detection, prevention, interdiction, and apprehension of terrorists, terrorist weapons, and other contraband and persons from illegally entering or attacking the United States. Typical duties include: Conducting air patrol, surveillance, and pursuit activities related to the interdiction of smuggled contraband via land vehicles, aircraft, or vessels. Monitoring behavior patterns and activities of suspect persons, vehicles, or vessels believed to be engaged in illegal activities. Collecting, refining, and analyzing strategic and tactical intelligence. Searching persons, vessels, baggage, and cargo for contraband or weapons incidental to detention or arrest. Qualifications Experience: You qualify for the GS-11 grade level if you possess one (1) year of specialized experience equivalent to at least the next lower grade level, performing duties such as: Flying as a Pilot-in-Command or sole manipulator in an airplane and helicopter in all environments of flight, including night, poor weather, unfavorable terrain, low altitudes, or speed. Evaluating information rapidly and making judicious decisions promptly during in-flight operations. Developing strategies and coordinating aircraft and ground assets. Using information systems and databases to conduct information surveys, queries, update files and disseminate information. Experience may include Operation of an aircraft as Captain, Pilot in Command, Aircraft Commander, First Officer, Certified Flight Instructor, Second in Command, or Co-pilot. Hiring Minimums: Pilot Enter on Duty minimums are 1500 flight hours; (up to 500 hours can be waived, reducing the pilot enter on duty minimums to 1000 hours; see Required Documents in the job announcement regarding the Flight Hour Waiver). A current FAA Commercial or ATP Pilot Certification with one of the following ratings: Dual Rated: Airplane (Single-engine land or multi-engine land) with instrument rating AND Rotorcraft Helicopter with instrument rating. Airplane Rated: Airplane (Single-engine land or multi-engine land) with instrument. Helicopter Rated: Rotorcraft Helicopter with instrument rating. Equivalent military rating of the above at the time of application (eligibility based on military flight experience must provide official orders, forms or logbooks showing their status as a rated military pilot). 250 Pilot-in-Command hours; 75 Instrument hours; 75 Night hours (Flight Hour Waiver available, see Required Documents); and 100 Flight hours in the last 12 months–TEMPORARILY WAIVED THRU AUGUST 1, 2024. All other flight hours requirements listed remain in effect. FAA Class I medical required for assessment dated within last 12 calendar months; FAA Class II medical will qualify. It must be dated within last 12 calendar months. However, at the time of your Flight Assessment you MUST present a FAA 1st Class Medical Certificate dated within the previous 12 calendar months. Apply at 750 hours total time - Applicants applying at 750 flight hours are required to obtain at least 1,000 flight hours (depending on the number of hours approved for a waiver) at own expense before being able to attend the 3-part flight assessment. Applicant must still meet 250 Pilot-in-Command, 75 instrument, 75-night hours and 100 flight hours in the last 12 months. UAS Flight Hours: Applicants may include UAS Predator A (MQ-1), Predator B (MQ-9) flight hours and Predator A (MQ-1), Predator B (MQ-9) or predator based variant flight hours. These hours may be credited towards satisfying the \"Total flight time\" 1,500 flight hour requirement only. UAS hours do not count towards the 250 flight hours as a Pilot in Command, 75 flight hours Instrument, and 75 flight hours Night. Flight hour logbooks will be required at time of your Flight Assessment for verification. Other Requirements Citizenship : You must be a U.S. Citizen to apply for this position. Residency : You must have had primary U.S. residency (includes protectorates as declared under international law) for at least three of the last five years. Age Restriction : In accordance with Public Law 100-238, this position is covered under law enforcement retirement provisions. Candidates must be referred for selection to the Border Patrol Agent position before reaching their 40th birthday in accordance with Department of Homeland Security Directive 251-03. The age restriction may not apply if you are currently serving or have previously served in a federal civilian law enforcement (non-military) position covered by Title 5 U.S.C. 8336(c) or Title 5 U.S.C. 8412(d). Travel Required: You may be expected to travel for this position based on operational needs. How to Apply Click the Apply button on this site. You will be linked to the CBP Talent Network page. For Position of Interest select Air and Marine Operations (Air Interdiction Agent/Pilot), then complete the pre-screening questions. You’ll receive monthly emails with information about webinars, career expos, and future opportunities with AMO and CBP. You will then be provided with links to the Job Opening Announcements (JOAs) on USAJOBS , the federal government’s official employment site, to complete your application. Be certain to review ALL details of the job opening announcement and follow all instructions in the application process. THIS IS A DIRECT HIRE PUBLIC NOTICE: Category rating, Veterans' Preference and traditional rating and ranking do not apply to this Public Notice. Applicants will be referred for selection consideration throughout the announcement open period","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTwxBOOXT2Eqb2puCV8deaUtkq2JDf9fl5WGOdj&s=0","location":"Green, CA","employmentType":"Health insurance","datePosted":"26 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Military Hire","url":"https://www.militaryhire.com/jobs-for-veterans/job/10101299/Pilot-Customs-and-Border-Protection/state/California/city/Green/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"bXJMMlZnSG9NMUhzZXZsVUFBQUFBQSUzRCUzRCUzQmdyZWVuJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"General Maintenance Tech","company":"Palo Alto Alvarado Concepts","description":"Be Your Best Self! See it, Own it, Crush it! Make Moments Count!\n\nAlvarado Restaurant Nation is seeking a highly skilled General Maintenance Technician to support restaurants by ensuring facilities are well-maintained and in good repair...\n\nYour Impact\n• Use your expertise to perform necessary maintenance on restaurant buildings across multiple sites.\n• Repair and replace tiling, light fixtures, drywall, cabinets, shelving, and perform minor plumbing and electrical repairs.\n• Maintain a safe and organized work area, use hand and power tools appropriately, and complete other repairs as needed.\n\nYour Qualifications\n• Valid driver's license and acceptable driving record\n• 2+ years of experience in tiling, plumbing, electrical, painting, drywall, or woodwork.\n• Experience working in general maintenance within the restaurant industry is preferred.\n• Flexible and willing to work a varied schedule\n• Self-starter, process and solutions-focused, enthusiastic and supportive of the company's mission and values\n• Able to remain positive in high-pressure situations\n\nYour Pay and Benefits\n• Competitive pay: $22-$25/hour\n• Benefits: medical, dental, vision, voluntary life and disability options\n• Flexible Schedules\n• Free GED program and Live Más Scholarships\n\nAt Alvarado Restaurant Nation, we embrace a \"Can Do, Will Do\" attitude and encourage our team members to be their best selves. Join our family and make moments count while crushing it with your passion and grit.\n\nPlease note that you are applying for a position with a franchisee or licensee of Taco Bell, not Taco Bell Corp. or any of its affiliates. Franchisees and licensees are independent business organizations responsible for their own employment practices, including setting their own wage and benefit programs.\n\nAre you ready for a challenge? Apply today!\n\n#GeneralMaintenanceJobs #MaintenanceTechnician #MaintenanceWorker #MaintenanceJob #FacilitiesMaintenance #BuildingMaintenance #MaintenanceWork #MaintenanceCareer #MaintenanceJobsNearMe #IndustrialMaintenance #PropertyMaintenance #MaintenanceSupervisor #MaintenanceEngineer #MaintenanceManagement #MaintenanceService","image":"","location":"Green, CA","employmentType":"Health insurance","datePosted":"6 days ago","salaryRange":"","jobProviders":[{"jobProvider":"CareerRookie","url":"https://www.careerrookie.com/job/J3S18465D6BQJ7XXNDM?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"WkRCQms2ZlpPWlZmNTdwUEFBQUFBQSUzRCUzRCUzQmdyZWVuJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Driver (Mobile Assistant)","company":"Covelo Group","description":"Under the supervision of the Mobile Operations and the day-to-day work direction of the mobile or center charge nurse, the Driver Mobile\nAssistant operates a self-contained mobile blood collection unit, setting up at remote blood collection (mobile) sites and returning to the Blood\nCenter...\n\nWhat you will do\n\nAt mobile locations, act as Donor Room Assistant under the direction\nof the on-site supervisor/charge nurse, including, but not limited to:\n\n• Keep confidential records about donor medical history card\nand unit numbering.\n\n• Label blood bags.\n\n• Heat seal donor unit tubing into segments.\n\n• Escort donors and assist with donors who have reactions.\n\n• Operate self-contained mobile blood collection unit, set\nup at remote blood collection (mobile) sites, and return to Blood Center (Class\nB driver’s license required).\n\n• Responsible for keeping mobile units clean, operational,\ngassed, and containing adequate supplies and equipment. Vehicles and equipment\nmust be maintained to be ready for emergency dispatch. Inventory and order\nsupplies are included on mobile units.\n\n• Load, transport, assemble, and dismantle mobile equipment,\nmedical supply boxes, and computers for mobiles at businesses, other\ncommunities, or civic locations within surrounding communities. Rearrange\nexisting furniture at mobile sites when necessary.\n\n• Ensure all equipment on mobile units (donor beds,\nequipment boxes) is always operational. Report malfunctioning equipment to the appropriate\ndepartment. Coordinate repairs of mobile vehicles when necessary. Operate\ncars within the limits of the law at all times (fines resulting from\ninfractions will be at your own expense.)\n\n• Responsible for deliveries to and from the blood center to\nfacilitate the efficient operation of the blood center and mobile unit.\n\nTransport blood to the component laboratory; ensure blood\ntransport boxes/coolers are correctly used and temperature quality control\nmaintained. Prepare and distribute supplies and equipment for mobile\nunits/locations and fixed site locations according to the requirements of the\nCollections department.\n\n• Completes a variety of other support activities related to\nactivities in blood collection areas as directed by supervisory/charge nurse\nstaff.\n\n• Train new drivers in all aspects of the job, including\ndriving and DRA responsibilities. Recognize personal responsibility to comply\nwith safe and healthful work practices. Comply with government regulations and\nBlood Center policies regarding health and safety. Observe and support good\nhealth and safety practices. Respect and maintain the confidentiality of\ndonors, patients, and staff records and use complete discretion when discussing\nthese matters. Validate trip sheets to ensure directions to mobile sites are\nclear and accurate.\n\n• Comply with governmental regulations and Stanford Health\nCare and Blood Center policies regarding health and safety. Observe and support\ngood health and safety practices.\n\n• Strictly observe privacy and security-related\npolicies, procedures, and practices to preserve the integrity and\nconfidentiality of medical and other sensitive information about donors,\npatients, research subjects, and employees. Act as a responsible information\nsteward and treat information as sensitive and confidential by federal and\nstate laws and with professional ethics, accreditation standards, and legal\nrequirements. Do not disclose protected health information inappropriately.\n\n• They may be required to enter areas where other individuals work with human blood; potential for unanticipated exposure to bloodborne splash or spill may exist.\n\n• Education Qualifications\n\n• High School Diploma or GED Required Experience\nQualifications\n\n• 1 year to 2 years Class B driving experience with valid\nlicense and verifiable good driving record Required\n\n• 1 years to 2 years Experience driving a 50-foot vehicle\nPreferred Required Knowledge, Skills, and Abilities • Must communicate\neffectively in English, both orally and in writing.\n\n• Demonstrated tact and courtesy required.\n\n• Must be able to lift and carry 50-75 pounds.\n\n• Must be able to pass color-blind and drug/alcohol\nscreening tests. Licenses and Certifications\n\n• CADL - California Drivers License - Valid And State\nrequired Upon Hire Physical Demands and Work Conditions Physical Demands •\nOccasional Sitting.\n\n• Frequent Walking.\n\n• Occasional Standing.\n\n• Occasional Bending.\n\n• Occasional Squatting.\n\n• Seldom Climbing.\n\n• Occasional Kneeling.\n\n• Seldom Crawling.\n\n• Frequent Hand Use.\n\n• Occasional Repetitive Motion Hand Use.\n\n• Frequent Grasping.\n\n• Occasional Fine Manipulation.\n\n• Frequent Pushing and Pulling.\n\n• Occasional Reaching (above shoulder level).\n\n• Frequent Twisting and Turning (Neck and Waist).\n\n• Frequent Vision (Color, Peripheral, Distance, Focus). Must\npass a color blind test. Lifting\n\n• Frequent lifting of 0 - 10 lbs. 1 to 5 in height\n\n• Frequent lifting of 11 - 20 lbs. 1 to 5 in height\n\n• Occasional lifting of 21 - 30 lbs. 1 to 5 in height\n\n• Occasional lifting of 31 - 40 lbs. 1 to 5 in height\n\n• Occasional lifting of 40 lbs. 1 to 5 in height Carrying\n\n• Frequent carrying of 0 - 10 lbs. 6 to 50 in distance\n\n• Frequent carrying of 11 - 20 lbs. 6 to 50 in distance\n\n• Occasional carrying of 21 - 30 lbs. 6 to 50 in distance\n\n• Occasional carrying of 31 - 40 lbs. 6 to 50 in distance\n\n• Occasional carrying of 40 lbs. 6 to 50 in distance\nWorking Environment\n\n• Frequent Driving of cars, trucks, forklifts, and other\nequipment. Drives bus\n\n• Occasional Working around equipment and machinery.\n\n• Occasional Walking on uneven ground.\n\n• Occasional Exposure to excessive noise.\n\n• Frequent Exposure to extremes in temperature, humidity, or\nwetness.\n\n• Frequent Exposure to dust, gas, fumes, or chemicals.\n\n• Seldom Working at heights.\n\n• Occasional Operation of foot controls or repetitive foot\nmovement.\n\n• Frequently working with biohazards such as bloodborne hospital waste, etc. Blood Borne Pathogens\n\n• Category I - Tasks that involve exposure to blood, body\nfluids, or tissues","image":"","location":"Green, CA","employmentType":"No degree mentioned","datePosted":"16 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Salary.com","url":"https://www.salary.com/job/covelo-group/driver-mobile-assistant/j202407012039510106912?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"amJSLXhtVS1RVW5GM1ZvcEFBQUFBQSUzRCUzRCUzQmdyZWVuJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Solution Architect","company":"StarHub","description":"Job Description\n\nThe Solution Architect leads unique and highly complex projects involving design, development and implementation of system architectures. He/She will plan and monitor the design of artefacts into enterprise systems and how they relate to the overall enterprise system architecture. He/She will be involved in the development and application of new solutions in the infrastructure... He/She recommends and leads the adoption of new technological advances and best practices in infrastructure systems to ensure they are well integrated. He/She identifies and resolves unique and complex issues which have organisation-wide and long-term impact. He /She mentors and provides technical leadership to the junior staff.\n\nHe/She should have a creative and critical mind and enjoys identifying linkages and interconnections among various parts of a system or architecture. He/She is a technical expert who should also be people-oriented, consultative, developmental and actively engaging stakeholders to design optimal secure system architectures.\n\nResponsibilities\n\n⦁ Maintain broad technical proficiency and should also possess knowledge of the competitive landscape, industry trajectory and prevailing market trends\n⦁ Work with internal or external presales consultants for detailed technical requirement and design\n⦁ Prepare and deliver the composite solutions for customers, including proposal writing and presentation\n⦁ Able to translate business’ need to technical requirement; using technology to resolve business challenges\n⦁ Participate in the business development lifecycle. Identify opportunities, generate proposals, and support other sales efforts\n⦁ Worked with the various team to design and architect the end-to-end application and infrastructure solution\n⦁ Aligning solution architecture, including statement of work, design, schedules and other contractual documents) with final terms and conditions\n⦁ Ability to meet customer goals and objectives for the project within budget and on time\n⦁ Work closely with the Account team, Solution Sales &amp; Service Delivery team and the customer to ensure a smooth transition from design to implementation and support.\n\nRequirements\n\n⦁ Degree in IT or related field with relevant technical certifications in various technologies and working experience in similar role for at least 8 years\n⦁ Sound technical knowledge in the some or all of these areas: networking, system, cloud and cyber security\n⦁ Relevant experience in a role or similar capacity that\n⦁ Provide support for complex opportunities\n⦁ Design and Architect end to end solutions that consists of multiple technologies of software, hardware or services\n⦁ Write and provide content for bids and proposals\n⦁ Research and analytical skills\n⦁ Business acumen, able to communicate effectively with all level of stakeholders\n⦁ Able to adapt to a dynamic and fast-pace environment","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT4NBomvaZtqDyamQbjPLCukVSdVwVlylhPZ7Ka&s=0","location":"Green, CA","employmentType":"Contractor","datePosted":"6 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Recruit.net","url":"https://www.recruit.net/job/solution-architect-jobs/B441BBD826C22CBE?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"ak5kM2tLNEJTc3NsZHlnV0FBQUFBQSUzRCUzRCUzQmdyZWVuJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Full Charge Bookkeeper","company":"Green, Polack and Company Accountancy Corporation","description":"CPA Firm is seeking a full-charge Bookkeeper to join our team. The ideal candidate will be responsible for multiple client accounts, be able to assist clients with accounting issues, have some tax preparation experience, and enjoy working closely with clients regarding financial matters.\n\nDuties...\n\n- Ability to take client account information and make necessary adjustments to conform to accounting standards\n- Prepare financial statements and reports\n- Reconcile accounts\n- Process payroll and prepare payroll reports\n- Utilize QuickBooks software\n- Assist with income tax preparation\n- Meet weekly, monthly, quarterly, and annual deadlines as required\n\nSkills:\n\n- Proficiency in accounting principles\n- Knowledge of governmental compliance requirements\n- Working knowledge of bookkeeping software QuickBooks and tax preparation software Lacerte\n- Ability to handle payroll responsibilities\n- Proficiency with Microsoft Office applications\n\nThis position offers the opportunity to work in a close-knit environment with a flexible schedule. Pay will be dependent on experience and benefits are offered. An Associates Degree in Accounting or Business is preferred, and 2 years minimum accounting/bookkeeping experience is required.\n\nJob Type: Full-time\n\nPay: $22.00 - $28.00 per hour\n\nExpected hours: 40 per week\n\nBenefits:\n• Flexible schedule\n• Health insurance\n• Paid sick time\n• Paid time off\n\nExperience level:\n• 2 years\n\nPhysical setting:\n• Office\n\nSchedule:\n• 8 hour shift\n• Monday to Friday\n\nWork Location: In person","image":"","location":"Lodi, CA","employmentType":"Health insurance","datePosted":"9 days ago","salaryRange":"22–28 an hour","jobProviders":[{"jobProvider":"Glassdoor","url":"https://www.glassdoor.com/job-listing/full-charge-bookkeeper-green-polack-and-company-accountancy-corporation-JV_IC1147536_KO0,22_KE23,71.htm?jl=1009360404944&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Indeed","url":"https://www.indeed.com/viewjob?jk=f815fc1c9234a72b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"SimplyHired","url":"https://www.simplyhired.com/job/r27sVGST_dJk5PajbBZ8RNQ22vB0RFEmPn7v7S_r4Fn1thizAA5ijQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"dnRZeWtLZXpGeUhzRXVlbUFBQUFBQSUzRCUzRCUzQmdyZWVuJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Maintenance Worker","company":"Extended Stay America","description":"Our Extended Stay San Ramon, CA location has an immediate need for a Maintenance Engineer! The Maintenance Engineer (or \"ME\") position must demonstrate and promote a strong commitment to providing the best possible experience for our guests and associates. The position is responsible to ensure that all property equipment is functioning, premises are maintained in a pristine condition, and that... all guest rooms are in good repair. The postion is responsible for ensuring that all tasks outlined in the Green Shield Binder and as directed by the management team and/or Regional Asset Manager are completed in a timely fashion in accordance with company standards.\n\nWatch A Day in the Life video for Maintenance Engineer https://vimeo.com/showcase/5180017/video/291575214\n\nMAJOR / KEY JOB DUTIES\n• Demonstrates and promotes a 100% commitment to providing the best possible experience for our guests and associates.\n• The ME must be able to work with minimal supervision while performing all essential duties to satisfaction and company standard.\n• Job function to include assisting guests upon request, responding to all guest requests with diligent follow through in accordance with company guidelines and procedures.\n• Job function to include performing the out of room cleaning outlined in the Green Shield Binder to ensure that the premises are maintained in pristine condition. This includes but is not limited to trash and debri, trash containers, cleanliness of building interior and exterior, grounds, walkways, stairwells, driveways and parking areas.\n• Job functions to include performing repairs listed on work orders and following the work order process as outlined in the Green Shield Binder. Repairs must be made in a timely fashion and professional manner.\n• Job functions to include preventative maintainance inspections and repairs as outlined in the Green Shield Binder.\n• Job functions to include following the Green Shield Inspection schedule on a daily basis in order to accomplish all tasks outlined in a timely fashion in accordance with company standard.\n• Job functions to include maintaining all records as outlined within the Green Shield Binder to include but not limited to Guest Room PM deficiencies, PM Room Inspections, Life Safety Inspections, Elevator Inspections and Non-Guest Room Deficiency Log.\n• Job function to include following the outlined work flow on the Green Shield Schedule, utilizing the SOPs as a reference guide to complete all tasks per company standard.\n• Job function to include maintaining an organized and clean work area in the maintenance room, while managing and safe guarding all maintenance tool inventory on a daily basis. Need to ensure that all tools are in good working condition.\n• Job function to include maintaining a clean and organized boiler room, electric rooms, HVAC rooms, fire sprinkler rooms, in accordance with company standard and local ordinance.\n• Job function to include ensuring that all fire safety equipment (fire alarm system, smoke detectors, CO detectors, fire extinguishers, etc) are operational and that inspections are current and in compliance with company standards and local ordinance.\n• Compliance with all ESA safety and security policies and procedures to include OSHA and ADA.\n• Job function to include maintenance of pool and or spa in accordance with ESA policies, procedures and in compliance with local ordinance.\n• Job functions to include assisting with or handling the response to emergencies at the property or sister location when asked by management.\n• Job functions to include monitoring and follow up with outside vendors when directed by management.\n\nOTHER DUTIES\n• Assisting with cleaning any areas of the hotel as assigned by the manager when needed to include but not limited to font desk, associate breakroom, guest laundry, fitness room, vending areas, stairwells and common areas.\n• Responsible for maintaining overall hotel cleanliness.\n• Other duties as requested by the management team.\n\nBENEFITS\n• Vision Insurance\n• 401(k) Savings Plan\n• Employee Assistance Program (EAP)\n\nJob Type: Full-time\n\nPay: From $21.00 per hour\n\nBenefits:\n• 401(k)\n• 401(k) matching\n• Dental insurance\n• Employee assistance program\n• Employee discount\n• Health insurance\n• Life insurance\n• Paid time off\n• Referral program\n• Vision insurance\n\nSchedule:\n• 8 hour shift\n• Day shift\n• Monday to Friday\n\nExperience:\n• Maintenance: 2 years (Required)\n\nAbility to Commute:\n• San Ramon, CA 94583 (Required)\n\nWork Location: In person","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQtA28CMk1YHePsBg2d2n7GkF9uk6TFdTmIXzc6&s=0","location":"San Ramon, CA","employmentType":"Dental insurance","datePosted":"21 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Salary.com","url":"https://www.salary.com/job/extended-stay-america/maintenance-worker/j202405050206597234191?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"San Ramon, CA - Geebo","url":"https://sanramon-ca.geebo.com/jobs-online/view/id/1353764276-maintenance-worker-/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"R2wyb3h3SGZHV0pqa3o2MkFBQUFBQSUzRCUzRCUzQmdyZWVuJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Clerk II at Bowling Green McCoy","company":"Sacramento City USD","description":"About the Employer\n\nThank you for your interest in the Sacramento City Unified School District...\n\nFor more than 160 years, SCUSD has served Sacramento families with quality public schools that prepare students for college and careers. We offer a wide variety of programs to meet different student needs in a district that reflects the diversity of our city and state.\n\nBecome a Sacramento City Unified employee and join a team committed to Sacramento's future. We approach each day with creativity and passion, knowing that the young lives we inspire are Sacramento's next generation of leaders.\n\nJoin us. You'll love your inspiring career in the heart of Sacramento.\n\nRequirements / Qualifications\n\nTRAINING, EDUCATION, AND EXPERIENCE:\n\nAny combination equivalent to: graduation from high school, and one year of clerical experience.\n\nLICENSES AND OTHER REQUIREMENTS:\n\nOverall scores in computer software testing program preferred as follows:\nKeyboarding 45 Correct WPM\nWord 40% Overall Score\nExcel 40% Overall Score\n\nMust provide 3 professional references when applying for this position.\n\nComments and Other Information\n\nClear\nMonday-Friday\n8 hours per day","image":"","location":"Florin, CA","employmentType":"Full-time","datePosted":"2 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Jobs","url":"https://www.whatjobs.com/job/Clerk-II-at/florin/1639759969?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"Q3A3VlRkaVlrSW1lMVpUS0FBQUFBQSUzRCUzRCUzQmdyZWVuJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Scheduler - Green Township Cardiology - Full Time - Days","company":"The Christ Hospital Health Network","description":"Acts as medical secretary to medical director and schedules patient care activity in the office and facilitates flow of information between physician, patient, and the referring physician.\n\nManages daily patient and physician scheduling using appropriate systems for ordering of labs, diagnostic test orders and scheduling. Provides clerical support to clinical team. Obtains records, films, etc. in... preparation of daily schedule. Assignments may be of a confidential manner and require judgment and discretion at all times.\n\nAnswers telephone makes daily patient, physician and other phone calls. Transcribes, distributes and files correspondence and administrative documents. Coordinates meeting plans and travel arrangements for physician. Attend and take minutes for meetings. Opens and sorts mail. Order Supplies as needed.\n\nChecks out patients, answers questions, schedules follow-up appointments or testing, collect co-pays.\n\nVerifies referrals and performs pre-certifications as appropriate. Manages and updates to volumes of patient care policies. Assist with training of new schedulers.\n\nMaintains cash drawer, reconciles balances, prepares deposits by completing deposit slips, may take deposits to the bank, batches fee tickets, checks for their accuracy and completion, completes batch header documentation, and submits batches to CBO daily.\n\nAll other duties as assigned.\n\nEDUCATION: High School Diploma or equivalent required, Associates degree or Medical Secretary Certification preferred.\n\nYEARS OF EXPERIENCE: 2 years medical office experience and 1-year prior scheduling experience required. Administrative or secretarial experience preferred.\n\nREQUIRED SKILLS AND KNOWLEDGE: copier, fax, telephone system, postage equipment, and computer skills (Microsoft Outlook, Word, and Excel). Excellent organization and communication skills required. Must be able to multi-task and maintain confidentiality.\n\nFor more than 130 years, The Christ Hospital been the beacon for exceptional healthcare in the Greater Cincinnati community. We're industry pioneers, always pushing the boundaries and reimagining the future of healthcare.\n\nOur culture promotes collaboration, diversity and innovation. Together, as a team, we work tirelessly to enhance healthcare quality, accessibility and safety","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRWea3O1wXP4d61BIy6jIKvatHQDwwKG3O7Hb_6&s=0","location":"Green, CA","employmentType":"Full-time","datePosted":"9 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Recruit.net","url":"https://www.recruit.net/job/scheduler-green-township-cardiology-jobs/0D07E635C7CA9B69?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"eERfRzZpcEE4U05GX2hoZkFBQUFBQSUzRCUzRCUzQmdyZWVuJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Fabric Cleaner","company":"Handy","description":"[Professional Cleaner] - PT or FT / Easy Payments With Competitive Pay Rates / Flexible Scheduling / Access to Handy's Large Customer Base - As a Handy Pro Fabric Cleaner you'll: Be responsible for delivering exceptional fabric cleaning services to our customers' homes; Perform fabric cleaning tasks using appropriate techniques and equipment, including steam cleaners, extraction machines, and specialized cleaning solutions; Clean and treat a variety of fabric surfaces, including upholstery, carpets, rugs, curtains, and mattresses, to remove stains, odors, and allergens; Vacuum, shampoo, and steam clean carpets and rugs to remove dirt, dust, and debris embedded deep within the fibers...Hiring Fast &gt;&gt;","image":"","location":"Green, CA","employmentType":"Full-time","datePosted":"12 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Jobrapido.com","url":"https://us.jobrapido.com/jobpreview/3302326597?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"UUtGLXJ1a3dKeDBSWVRQVUFBQUFBQSUzRCUzRCUzQmVuZXJneSUyMFN0b2NrdG9uJTJDJTIwQ2FsaWZvcm5pYSUyMCUyMCUzQg==","title":"Utility Worker - GC- Gas","company":"PG&amp;E Corporation","description":"Requisition ID # 157830\n\nJob Category: Maintenance / Construction / Operations...\n\nJob Level: Individual Contributor\n\nBusiness Unit: Gas Operations\n\nWork Type: Onsite\n\nJob Location: Stockton\n\nDepartment Overview\n\nGas Operations is focused on ensuring the safe and reliable flow of natural gas to our customers. Gas Operations is responsible for all aspects of PG&amp;E's gas distribution and transmission operations, including planning, engineering, maintenance and construction, restoration and emergency response.\n\nPosition Summary\n\nThis is an IBEW Local 1245 represented classification, which has over 100 years of experience representing employees at PG&amp;E and is subject to collective bargaining.\n\nWe are looking for an energetic and career oriented individual to join our Energy Delivery, Gas Transmission &amp; Distribution General Construction team. The Utility Worker position is an entry level position with advancement opportunities for motivated individuals who perform successfully. Work is predominantly outdoors and in all weather conditions.\n\nThe position is a General Construction position and individuals must be able to travel and transfer to a new headquarters upon request at any time; throughout the entire PG&amp;E service territory with no guarantees as to how long you will be away from home. The individual must be able to drive safely, work extended hours; travel 100% of the time, and wear company provided Personal Protective Equipment. This position may be in various locations throughout the PG&amp;E service territory that may be in the Northern, Central Valley, or Southern region.\n\nPG&amp;E is providing the hourly rate that the company in good faith believes it might pay for this position at the time of the job posting. This position is subject to collectively bargained hourly wage rates and increases. The starting wage rate for this position is $37.34 per hour. This wage rate is specific to the locality of the job. The wage rate is based on multiple factors, including, but not limited to, specific skills, education, licenses or certifications, experience, market value, geographic location, collective bargaining agreements, and internal equity.\n\nThis position is a DOT (Department of Transportation) covered classification and is subject to random drug and/or alcohol screening.\n\nPer Letter of Agreement R1-22-04-PGE, an employee will be in a 2-year commitment.\n\nJob Responsibilities\n\nGeneral Duties:\n• Must work safely at all times as defined by PG&amp;E’s safety standards and procedures.\n• Follow the direction of their journeyman, crew lead and/or supervisor at all times.\n• Must be able to read and comply with all required company standards and procedures.\n• Must work in a team environment.\n• Must be able to obtain a Class A Driver’s License within 12 months.\n• Must be able to pass Post Offer Physical Assessment.\n• Hand excavate in an ergonomically safe manner.\n• Load and unload equipment, material, job site debris and maintain housekeeping according to PG&amp;E’s safety standards and procedures.\n• Perform construction and maintenance on gas lines and underground electric infrastructure.\n• Maintain tools and equipment.\n• May be required to perform traffic control functions under the direction of a Gas Crew Leader.\n• Ability to pass a medical assessment to wear respirator protection as needed when working around gaseous or hazardous atmosphere.\n• Ability to travel and transfer to a new headquarter upon request at any time; throughout the entire PG&amp;E service territory with no guarantees on how long you will be assigned away from your base headquarters.\n• Contribute toward Gas Safety Excellence goals by improving safety, reliability and\n• affordability for one or more asset families and one or more life cycles.\n• Performs pipe wrapping duties.\n• Assists in construction and maintenance and other miscellaneous semi-skilled work.\n• Performs semi-skilled work assisting a higher classified employee.\n• DOT-Operations/Maintenance AND Emergency\n\nMinimum Qualifications\n• Must be at least 18 years of age.\n• Must possess a High School diploma or GED.\n• Must be able to wear company provided Personal Protective Equipment (PPE).\n• Internal PG&amp;E employees: Must have qualified on the Physical Test Battery (PTB) exam and Work Orientation Inventory Test (WOI), prior to applying for the position.\n• External and Hiring Hall Candidates: Must qualify on the Physical Test Battery (PTB) exam and Work Orientation Inventory Test (WOI), prior to interviewing.\n• Must be able to lift and maneuver up to 90 pounds.\n• Must pass Utility Worker Training course, which takes place for approx. 15 business days, during the first three weeks of employment.\n• Ability to work extended hours to include nights, weekends and holidays when required.\n• Must possess and maintain a valid Class C California Driver's License (or higher) by Day 1 of hire\n• Must possess and maintain a valid Class A California Driver's License Permit by within 3 months of hire\n• Ability to work in all types of weather extremes.\n• Ability to drive safely in all weather and road conditions.\n• Ability to travel and transfer to a new headquarter upon request at any time; throughout the entire PG&amp;E service territory with no guarantees on how long you will be assigned away from your base headquarters.\n\nDesired Qualifications\n• Previous experience in construction such as Underground Utility, Trenching Equipment, Welding, Carpentry, Plumbing, Pipefitting, Farm Ranch Hand and/or Landscaping.\n• Knowledge of Pipeline Coating\n• Previous Military experience.\n• Graduation from a PowerPathway® Program is preferred.\n• Current or past work experience with PG&amp;E and/or Hiring Hall.\n• To better represent the communities, we serve within a timely manner, applicants who live within 50 miles of the headquarter location will be given preference\n\nPre-Employment Testing\n\nPG&amp;E Employees: You must have qualified on all prerequisite tests prior to submitting an application, and all secondary tests prior to interviewing. For more information on prerequisite and secondary exams, including study guides, please visit the Pre-employment testing program website.\n• Physical Test Battery\n• Post-Offer Physical Assessment Utility Worker\n• Work Orientation Inventory-Physical/Technical Driving","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQWnp-MWL4Y5QjgS9CIeWIYawaB1J1wdwTNWqSS&s=0","location":"Stockton, CA","employmentType":"Full-time","datePosted":"4 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Pacific Gas And Electric Company - PG&amp;E","url":"https://jobs.pge.com/job/stockton/utility-worker-gc-gas/29673/65732726672?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"ZipRecruiter","url":"https://www.ziprecruiter.com/c/Pacific-Gas-And-Electric-Company/Job/Utility-Worker-Gas-T&D/-in-Stockton,CA?jid=8295dd1db461cd57&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Jooble","url":"https://jooble.org/jdp/2961530123597309173?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"LinkedIn","url":"https://www.linkedin.com/jobs/view/utility-worker-gc-gas-at-pacific-gas-and-electric-company-3977359622?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"BeBee","url":"https://us.bebee.com/job/2139251a4990fe7b88e4f1a89b27b3f7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Glassdoor","url":"https://www.glassdoor.com/job-listing/utility-worker-gc-gas-pacific-gas-and-electric-JV_IC1147539_KO0,21_KE22,46.htm?jl=1009298789038&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Talentify","url":"https://www.talentify.io/job/utility-worker-gc-gas-stockton-california-pacific-gas-and-electric-157830?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Talent.com","url":"https://www.talent.com/view?id=718a12e240e4&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"OVEyVmQ3ZkJFY1B0UFJHUEFBQUFBQSUzRCUzRCUzQmVuZXJneSUyMFN0b2NrdG9uJTJDJTIwQ2FsaWZvcm5pYSUyMCUyMCUzQg==","title":"Power Plant Operations Supervisor","company":"DTE Energy","description":"DTE is one of the nation’s largest diversified energy companies. Our electric and gas companies have fueled our customer’s homes and Michigan’s progress for more than a century. And as Michigan’s largest source of renewable energy, we’re creating a cleaner, healthier environment to power our future. We’re also serving communities beyond Michigan, where our affiliated businesses offer renewable... energy, emission control technologies, and energy services to industries in 19 states. But we’re more than a leading energy company... and working at DTE is more than just a job. At DTE, we take great care of each other and our customers, and we use our energy to be a force for growth and prosperity in our communities. When you join us, you’ll be part of a team that welcomes, recognizes, and celebrates differences, and values everyone’s health, safety, and wellbeing. Are you ready to make that kind of difference? Bring your energy to DTE. Together, we can achieve great things. The pay range for this position is $96,000.00 - $130,000.00.\n\nJob Summary\n\nLocation: Stockton, CA\n\nA $5,000 signing bonus is being offered to the successful candidate.\n\nThe person holding this position is responsible during his/her shift for all personnel and equipment involved in the production of steam and electricity. He or she plans, coordinates, supervises, monitors, and controls all on-shift operations. As the senior individual on duty, he or she has the responsibility and authority to take whatever actions may be necessary to protect people, the environment and equipment.\n\nKey Accountabilities\n• Ensures that all site safety and environmental requirements and procedures are properly implemented and takes corrective actions as necessary\n• Plans, directs, and performs housekeeping duties. Ensures housekeeping standards are maintained or initiates corrective action, as required\n• Oversees and provides direct supervision and feedback on all operations, including startup, shutdown, inspection, routine chemical testing, all switching and tagging, equipment troubleshooting, writes, reviews, and revises operating and related procedures\n• Assists in facets of department administration and power plant management. Maintains administrative documents, preparation, justification and control of annual operations and maintenance budgets. Generates reports and initiates action to replenish consumables\n• Provides advice and counsel to leadership regarding the technical and administrative conduct of shift operations\n• Monitors planned daily operations schedule\n• Assists in the orientation, training, development, performance evaluation, selection process for new employees and promotions, and assures high work quality of O&amp;M Technicians\n• Serves as the site representative after normal hours\n• Plans, directs, and supervises routine preventive and predictive maintenance on all systems and equipment; supports corrective maintenance efforts on selected equipment\n• Communicates with other company personnel on-site and at other locations. Represents the company in dealing with steam and power customers, vendors, contractors, regulators, and other non-company personnel\n• Maximizes plant efficiency and shareholder value without compromising personnel and equipment safety, environmental compliance, or the long-term commercial viability of the facility\n• Available for scheduled and unscheduled shift coverage, performs tasks that require physical exertion and is expected to respond to off-hour call-ins when contacted by phone or company furnished pager or cell phone\n• Establishes and maintains high personnel and professional standards of safety and environmental conscientiousness and compliance\n• Supports all departments and performs other duties necessary to fulfill plant requirements\n\nMinimum Education &amp; Experience Requirements\n• A high school diploma or equivalent and knowledge and capabilities typically acquired through at least 3 years power plant related experience and 3 years supervisory or managerial experience\n\nOther Qualifications\n\nPreferred:\n• Experience with a solid fuel fired power plant\n\nOther Requirements:\n• Ability to read, write and communicate effectively and perform mathematical calculations\n• Knowledge of power plant safety policies and procedures, especially in the areas of high-energy systems, chemical handling, heavy equipment, rotating machinery, confined spaces, incipient fire suppression, and first aid\n• Proficiency in the use of Microsoft Office products, especially Word and Excel\n• Functional knowledge of subordinate and peer duties and responsibilities\n• Basic knowledge of or ability to understand fundamental principles related to physics, mathematics, AC and DC electrical theory, chemistry, water treatment process, thermal dynamics, heat transfer and fluid flow\n• Demonstrated knowledge regarding operation of valves, switches, controls, keyboards, and other devices associated with power plants\n• Working knowledge of maintenance management systems\n• Ability to comprehend and apply technical information, including mechanical and electrical drawings (such as blueprints, P&amp;IDs, single-line diagrams and schematics) to problem-solving situations and troubleshooting\n• Ability to locate, troubleshoot, and adjust defects in mechanical equipment and/or maintain, install, modify and trouble-shoot plant electrical systems and equipment without \"tripping\" equipment\n• Ability to communicate and coordinate work on technical subjects with others across job families and with outside vendors\n• Operating and maintenance experience with various analytical and test equipment\n• Demonstrated knowledge, skill and prior hands-on troubleshooting and repair experience relating to instrumentation and control systems used in modern power stations, including burner management, combustion control, boiler controls, turbine controls, machine condition monitoring and continuous emissions monitoring (CEMS)\n• Outstanding skill in leadership and interpersonal relationships\n\nPhysical Demands &amp; Working Conditions\n\nThe physical demands characterized here epitomize those that must be met by an employee to properly perform the integral functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. In order to properly perform the integral functions of this job, the employee is required to:\n• Sit, stand, walk, or climb and stoop or kneel. The employee will be required to be able to access all areas within the plant. Climbing stairs and ladders and maneuvering in awkward positions are all required\n• Frequently, the employee is required to sit\n• Talk or hear; use hands to finger, handle or feel; and reach with hands and arms extensively\n• Frequently lift objects of up to 10 pounds in weight. Occasionally the employee will have to lift or move objects of up to 25 pounds in weight. In addition, the employee will push or pull up to 25 pounds in weight occasionally\n• Vision requirements for this position include close vision, color vision, depth perception and the ability to adjust focus\n\nWhile performing the duties of this job, the employee works both in a business office setting and at a plant site. In the course of working at the plant site, the employee is occasionally exposed to outside weather conditions, including wet and/or humid conditions, and may work near moving mechanical parts and/or machinery. The employee is occasionally exposed to fumes or airborne particles and vibration. The noise level in the work environment is usually quiet to moderate in the office, but may become loud throughout the plant site.\n\nAdditional Information\n\nIncumbents may engage in all or some combination of the activities and accountabilities, and utilize a variety of the competencies cited in this description depending upon the organization and role to which they are assigned. This description is intended to describe the general nature and level of work performed by incumbents in this job. It is not intended as an all-inclusive list of accountabilities or responsibilities, nor is it intended to limit the rights of supervisors or management representatives to assign, direct and control the work of employees under their supervision.\n\nPRIVACY NOTICE TO CALIFORNIA JOB APPLICANTS\n\nAt DTE Energy, we are committed to providing an inclusive workplace where everyone feels welcome and a sense of belonging. We seek individuals with a heart for service, a passion to help our communities prosper, and ideas to help shape the future of energy. We are proud to be an equal opportunity employer that considers all qualified applicants without regard to race, color, sex, sexual orientation, gender identity, age, religion, disability, national origin, citizenship, height, weight, genetic information, marital status, pregnancy, protected veteran status or any other status protected by law","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQEAUnAZGsltBWtzaHx321mFIk8DrjiB9hJ-zjX&s=0","location":"Stockton, CA","employmentType":"Full-time","datePosted":"14 days ago","salaryRange":"","jobProviders":[{"jobProvider":"DTE Energy Careers","url":"https://careers.dteenergy.com/job/Stockton-Power-Plant-Operations-Supervisor-CA-95201/1142506700/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"ZipRecruiter","url":"https://www.ziprecruiter.com/c/DTE-Energy/Job/Power-Plant-Operations-Supervisor/-in-Stockton,CA?jid=35e763218824eaf7&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Indeed","url":"https://www.indeed.com/viewjob?jk=587a8ac5f7588540&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Diversity Jobs","url":"https://diversityjobs.com/career/7539959/Utility-Plant-Operations-Supervisor-California-Stockton?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"LinkedIn","url":"https://www.linkedin.com/jobs/view/power-plant-operations-supervisor-at-dte-energy-3853808973?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"BeBee","url":"https://us.bebee.com/job/ffe8810d4769ea9cb3cbf748e25f02ae?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Salary.com","url":"https://www.salary.com/job/dte-energy/utility-plant-operations-supervisor/j202403140851103749315?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"SimplyHired","url":"https://www.simplyhired.com/job/WB7RMPkU6iKl8ULJEDoiNc5UUc5oIZjY8uH58cFtJTP7AOymqtkgqA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"bV9SamFVR2ZrbGhxWmNmS0FBQUFBQSUzRCUzRCUzQmVuZXJneSUyMFN0b2NrdG9uJTJDJTIwQ2FsaWZvcm5pYSUyMCUyMCUzQg==","title":"IC&amp;E Technician","company":"DTE Energy","description":"DTE is one of the nation’s largest diversified energy companies. Our electric and gas companies have fueled our customer’s homes and Michigan’s progress for more than a century. And as Michigan’s largest source of renewable energy, we’re creating a cleaner, healthier environment to power our future. We’re also serving communities beyond Michigan, where our affiliated businesses offer renewable... energy, emission control technologies, and energy services to industries in 19 states. But we’re more than a leading energy company... and working at DTE is more than just a job. At DTE, we take great care of each other and our customers, and we use our energy to be a force for growth and prosperity in our communities. When you join us, you’ll be part of a team that welcomes, recognizes, and celebrates differences, and values everyone’s health, safety, and wellbeing. Are you ready to make that kind of difference? Bring your energy to DTE. Together, we can achieve great things. The pay range for this position is $38.24 - $48.46.\n\nJob Summary\n\nLocation: Stockton, CA\n\nThis position is responsible for installing, maintaining, testing, and troubleshooting instrumentation, controls, and electrical/electronic systems at a power plant. This is a “journeymen” level position with a high degree of knowledge of instrumentation, controls, low and medium voltage switchgear, transformers, generators, protective relays, and motor control centers. Work involves performing some difficult and complex functions requiring a high level of independent judgment, initiative, and discretion. Work is performed under direct supervision of a Plant Management and performance is reviewed against an established set of goals and Company policies and procedures.\n\nKey Accountabilities\n\n• Calibrate, test, maintain, troubleshoot, and install all plant instrumentation, control systems and electrical equipment\n\n• Perform maintenance on motor control centers, motor operated valves, generators, excitation equipment and motors\n\n• Perform preventive, predictive, and corrective maintenance on equipment, coordinating work with various team members\n\n• Troubleshoot and perform maintenance on DC backup power equipment, process controls, programmable logic controls (PLC) and emission monitoring equipment\n\n• Designs and installs new equipment and/or system modifications\n\n• Update and maintain Computerized Maintenance Management System (CMMS) to record time and material used, problems identified/corrected and further action required to preserve complete history of maintenance on equipment\n\n• Train other team members in the areas of instrumentation, control, and electrical systems\n\n• Perform equipment and system tagging in accordance with company and plant rules and regulations\n\n• Participate in small construction projects\n\n• Read and interpret drawings, sketches, prints and specifications as required\n\n• Order parts as needed to affect maintenance and repair\n\n• Schedule, coordinate, monitor and work with contractors on specific tasks as required\n\n• Comply with all site safety and environmental requirements and procedures\n\n• Perform operations in accordance with standard operating procedures (SOP’s) and prudent safety standards\n\n• Participation in the basic safety processes as key member of the Site Safety committee, leading monthly safety meetings and having a shared responsibility for the site's overall safety performance\n\n• Identify safety hazards and take corrective actions as necessary\n\n• Perform plant electrical switching and lock-out/tag-out (LOTO) of equipment in accordance with approved procedures and prudent operations and maintenance best practices\n\n• Develop, assist, and revise operations and maintenance related procedures to ensure optimal performance of systems\n\n• Perform and maintain plant housekeeping duties\n\n• Perform other duties as assigned\n\n• Communicate pertinent information to company personnel, customers and vendors\n\n• Assist other team members and works with all departments to support corporate and plant goals\n\n• Work scheduled and unscheduled overtime and respond to off-hour call-ins as needed\n\n• Leads and participates in assigned continuous improvement efforts throughout the facility\n\nMinimum Education &amp; Experience Requirements\n• High school diploma or GED\n• Five (5) years of power plant experience in instrument, controls, and electrical maintenance.\n• Strong electrical background to include voltages up to 15 KV\n• A valid driver's license and the ability to maintain is required\n\nOther Qualifications\n\nPreferred:\n• Demonstrated knowledge of electrical equipment, electronics, schematics, controls, and instrumentation\n• Demonstrated ability to calibrate I&amp;C systems and equipment, including analytic equipment\n• Demonstrated ability to configure and operate various test instruments and equipment as necessary to troubleshoot and repair plant equipment including, but not limited to distributed control systems, programmable logic controllers, motor control centers, transformers, generators, and continuous emissions monitor (CEM) systems\n• Ability to coordinate and work with others in a team environment\n• Ability to learn and become proficient in all site-specific systems and sub-systems\n• Ability to complete site-specific qualification training and periodic testing\n• Knowledge of plant safety policies, and procedures, especially in areas such as chemical handling, energy systems, confined spaces, fire suppression, and first aid\n• Knowledge of and ability to understand fundamental principles related to physics, mathematics, AC/DC electrical theory, heat transfer, fluid flow, thermal dynamics and chemistry\n• Ability to use basic hand tools, portable electric, pneumatic tools, and basic rigging equipment such as winches, hoists, and slings\n• Ability to locate, troubleshoot, and correct problems with mechanical and electrical system and ancillary equipment\n• Ability to effectively communicate verbally and in writing\n• Experience with Computerized Maintenance Management System (CMMS)\n• Proficient in Microsoft Office applications (Word, Excel, PowerPoint, and Outlook)\n\nPhysical Demands &amp; Working Conditions\n\nThe physical demands characterized here epitomize those that must be met by an employee to properly perform the integral functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. In order to properly perform the integral functions of this job, the employee is:\n• Frequently sit, stand, walk or climb and occasionally stoop, kneel or crawl.\n• Talk and hear; use hands to finger, handle or feel; and reach with hands and arms extensively.\n• Occasionally lift objects of up to 50 pounds in weight, frequently lift objects up to 10 pounds in weight and carry up to 35 pounds occasionally. In addition, the employee will push or pull up to 70 pounds in weight occasionally.\n• Vision requirements for this position include close vision, color vision and the ability to adjust focus.\n\nThe employee is frequently exposed to outside weather conditions, including wet and/or humid conditions, and routinely works near moving mechanical parts and/or machinery. The employee is occasionally exposed to fumes or airborne particles and vibration. The noise level in the work environment is usually loud.\n\nAdditional Information\n\nIncumbents may engage in all or some combination of the activities and accountabilities, and utilize a variety of the competencies cited in this description depending upon the organization and role to which they are assigned. This description is intended to describe the general nature and level of work performed by incumbents in this job. It is not intended as an all-inclusive list of accountabilities or responsibilities, nor is it intended to limit the rights of supervisors or management representatives to assign, direct and control the work of employees under their supervision.\n\nPRIVACY NOTICE TO CALIFORNIA JOB APPLICANTS\n\nAt DTE Energy, we are committed to providing an inclusive workplace where everyone feels welcome and a sense of belonging. We seek individuals with a heart for service, a passion to help our communities prosper, and ideas to help shape the future of energy. We are proud to be an equal opportunity employer that considers all qualified applicants without regard to race, color, sex, sexual orientation, gender identity, age, religion, disability, national origin, citizenship, height, weight, genetic information, marital status, pregnancy, protected veteran status or any other status protected by law","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQEAUnAZGsltBWtzaHx321mFIk8DrjiB9hJ-zjX&s=0","location":"Stockton, CA","employmentType":"Full-time","datePosted":"18 days ago","salaryRange":"","jobProviders":[{"jobProvider":"DTE Energy Careers","url":"https://careers.dteenergy.com/job/Stockton-IC&E-Technician-CA-95201/1185824600/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"ZipRecruiter","url":"https://www.ziprecruiter.com/c/DTE-Energy/Job/IC&E-Technician/-in-Stockton,CA?jid=dbfeb9a04e750c8d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Indeed","url":"https://www.indeed.com/viewjob?jk=e07bb178a4c8d2a4&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Glassdoor","url":"https://www.glassdoor.com/job-listing/ice-technician-dte-energy-JV_IC1147539_KO0,14_KE15,25.htm?jl=1009348700203&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"LinkedIn","url":"https://www.linkedin.com/jobs/view/ic-e-technician-at-dte-energy-3965710335?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Jooble","url":"https://jooble.org/jdp/6367809935938634037?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"BeBee","url":"https://us.bebee.com/job/5a888adef2ecdaee322dd561c141ef19?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Diversity Jobs","url":"https://diversityjobs.com/career/8372854/Ic-E-Technician-California-Stockton?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"NGRZWWl6YmlBcHpfeVNJVUFBQUFBQSUzRCUzRCUzQmVuZXJneSUyMFN0b2NrdG9uJTJDJTIwQ2FsaWZvcm5pYSUyMCUyMCUzQg==","title":"Service Coordinator - Energy Systems - Stockton, CA","company":"Generac Power Systems","description":"Company West Coast Energy Systems\n\nName Service Coordinator - Energy Systems - Stockton, CA...\n\nReq # 64113\n\nEmployment Type Full Time\n\nShift 1st\n\nAt Energy Systems, our people help make the world safer, brighter, and more productive. United by our Values, people with diverse backgrounds and points of view work together to ensure our customers have peace of mind.\n\nIt's a challenge, and an invitation. Most importantly, it's an opportunity to join an industry leader. There's never been a better time to work at Energy Systems. Our rapid growth equals rapid career advancement opportunities for those who want to be challenged and enjoy a fast-paced, high-performance culture.\n\nThe Service Coordinator position will be responsible for creating work orders, answering incoming service calls, quoting recommended service repairs, assisting with the job calendar, tech schedules, invoicing of service jobs and managing overall administrative workflow for the Service Department. These functions require electronic management of parts using company business systems. In addition, this position requires supporting other parts personnel as needed.\n• Creating work orders, answering incoming phone calls, and assisting with the scheduling of technicians\n• Invoicing completed work orders while monitoring GP goals\n• Following up on quoted service repair jobs and recommended repairs\n• Support of other Service departmental roles on an as needed basis\n• Required to support the parts and sales department as needed for to provide excellent customer service\n• Other Duties as assigned\n\nMinimal Qualifications:\nEducation\nHS Diploma or Equivalent\n\nWork Experience\n2 years of administrative experience in a service-related business\n2 years of scheduling field technicians and/or customer service\n\nKnowledge / Skills / Abilities\nComputer literacy is required, including a working knowledge of Microsoft Office applications (i.e. Outlook, Word, Excel)\nGeneral knowledge of service parts and service industry including but not limited to basic mechanical and technical aptitude\nIncorporate time management skills by prioritizing work assignments\nProven interpersonal skills with both internal and external customers, including being a team player to create synergy within the office and company\nMust be able to handle high pressure situations\nMust have basic math skills for computing percentages, multipliers, sales tax, and totals on parts orders\n\nPreferred Qualifications:\nPreferred Job Requirements\nEducation\nAssociate Degree or equivalent\n\nWork Experience\n4 years of administrative experience in a service-related business\n4 years of scheduling field technicians and/or customer service\n\nCompensation: Energy Systems is committed to fair and equitable compensation practices. The hourly rate for this role based in Stockton, CA is $19.65-$27.50. This compensation will ultimately be in line with the location in which the position is filled. Final compensation for this role will be determined by various factors such as a candidate's relevant work experience, skills, certifications, and geographic location. This role is eligible for variable compensation including short term and long-term incentives.\n\nBenefits:\nWe are an inclusive company that celebrates differences and keeps equity and respect at the forefront.\nCompetitive Benefits: Health, Dental, Vision, &amp; 401k\n401 (k) retirement savings plans with company match\nMedical support programs: Maternity, Diabetes, Treatment Decision Support and more\nWork-life benefits: PTO and Holidays\n\nPHYSICAL DEMANDS: While performing the duties of this job, the employee is regularly required to stand. The employee frequently is required to use hands to manipulate objects, tools, or controls; and talk and hear. The employee is regularly required to walk; stoop; crouch; bend and reach above shoulders. The employee must frequently lift and/or move up to 50 pounds unassisted and up to 100 pounds with assistance, waist high, up to 10 feet away. Specific vision abilities required by this job include close vision, distance vision, peripheral vision, and depth perception. The employee must comply with the assigned location PPE requirements including but not limited to safety glasses, hearing protection, appropriate gloves, clothing, and shields for required tasks and closed toed or safety shoes as required by facility safety policies.\n\n\"We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\"\n\nGenerac Power Systems Inc. is an equal opportunity employer/Minorities/Females/Vet/Disability","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRoxPL2jBPY2G_IEvkeAaGsy4_xiyNTjcrzKafp&s=0","location":"Stockton, CA","employmentType":"Dental insurance","datePosted":"12 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Salary.com","url":"https://www.salary.com/job/generac-power-systems/service-coordinator-energy-systems-stockton-ca/j202401201210034382173?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"MetroSacramentoJobs.com","url":"http://www.metrosacramentojobs.com/job/detail/77960963/Service-Coordinator-Energy-Systems-Stockton-CA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Montana Jobs - Tarta.ai","url":"https://montana.tarta.ai/j/6E17jIwBcRajQcTjizA41223-tax-preparer-in-great-falls-mt-at-h-r-block?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"bXJYaHJQQU5hX1ZwTHBHX0FBQUFBQSUzRCUzRCUzQmVuZXJneSUyMFN0b2NrdG9uJTJDJTIwQ2FsaWZvcm5pYSUyMCUyMCUzQg==","title":"Solar Maintenance Technician, Energy","company":"Tesla","description":"The Solar Maintenace Technician is an essential part of Tesla’s Field Energy Operations team. Employees working in this role are leading the drive towards completing Tesla’s mission—to accelerate the world’s transition to sustainable energy.  As an Installer, each employee is working with the latest solar technology, building relationships with team members, and completing the servicing of our... products safely and on time. \n\nTesla’s ideal candidate will have a passion for learning basic energy system construction, terminology, and concepts. This position is an hourly role that requires working outside in extreme environments, working at heights, and prolonged periods of repetitious duties including lifting, bending, and standing for long periods. \n\nJob posting details for Solar Maintenance Technician, Energy at Tesla in Stockton, California. Compensation / salary range: $18.29 - $43. ClimateTechList gathers 37,000+ job openings from over 1,840 climate tech companies and updates them daily","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRk4bk6Vokn3gq8lqyQ_0t5_WeGxQE5AlXvdvZr&s=0","location":"Stockton, CA","employmentType":"Full-time","datePosted":"3 days ago","salaryRange":"","jobProviders":[{"jobProvider":"ClimateTechList","url":"https://www.climatetechlist.com/job/tesla-solar-maintenance-technician-energy-5XhM177YqkoxMC?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"WnlWYmlyUDVsZkp3MnpHa0FBQUFBQSUzRCUzRCUzQmVuZXJneSUyMFN0b2NrdG9uJTJDJTIwQ2FsaWZvcm5pYSUyMCUyMCUzQg==","title":"Electric Distribution General Construction, Supervisor","company":"PG&amp;E Corporation","description":"Requisition ID # 158755\n\nJob Category: Maintenance / Construction / Operations...\n\nJob Level: Supervisor\n\nBusiness Unit: Electric Operations\n\nWork Type: Onsite\n\nJob Location: Stockton\n\nDepartment Overview\n\nThe Coworkers of Electric Operations ensure the delivery of safe and reliable electric service to our customers. Electric Operations is responsible for every aspect of PG&amp;E's electric distribution and transmission operations, including planning, engineering, maintenance and construction, asset management, business planning, restoration and emergency response.\n\nPosition Summary\n\nManages teams involved in maintaining or building parts, command &amp; control outage response, and monitoring and restoration efforts of the system-wide service territory distribution grid. Provides safe and reliable electric service while maintaining compliance with the California Public Utility Commission (CPUC) General Orders, and all procedures and safety regulations and other regulatory requirements.\n\nAnalyze and prioritize outages to determine most efficient restoration needs. Implements safety policies and best practices and manages employee’s accountability. Ensures full compliance with the Injury &amp; Illness Prevention Programs.\n\nPG&amp;E is providing the salary range that the company in good faith believes it might pay for this position at the time of the job posting. This compensation range is specific to the locality of the job. The actual salary paid to an individual will be based on multiple factors, including, but not limited to, specific skills, education, licenses or certifications, experience, market value, geographic location, and internal equity. Although, we estimate the successful candidate hired into this role will be placed towards the middle or entry point of the range, the decision will be made on a case-by-case basis related to these factors.\n\nA reasonable salary range is:​\n\nAnnual Minimum: $123,000.00\n\nAnnual Maximum: $197,000.00\n\nJob Responsibilities\n• Builds constructive and effective relationships using diplomacy and treats direct reports equitably. Completes and maintains all work documentation or reporting.\n• Develops and maintains regional contacts and Interacts with local government. Develops, reviews and/or executes action plans to address deficiencies in process or employee skill/knowledge and track the progress of those plans.\n• Effectively uses resources by monitoring crew productivity. Efficiently and accurately performs monitoring and analysis functions for ongoing projects and work efforts.\n• Ensures maintenance and construction work is completed on time and within budget and quality expectations, while monitoring compliance to standards and specifications.\n• Ensures that customers' needs and expectations are met. Provides clear, professional, proactive communication with customers in a variety of field situations during the project, while ensuring regulatory compliance and safety.\n• Facilitates or leads weekly team meetings/tailboards. Conducts training as needed.\n• Identifies and pursues productivity improvements and implements work practices to reduce operating costs while meeting corporate and regulatory compliance.\n• Identifies and reacts to complex field decisions, using technical knowledge and experience to move forward quickly, considering cost, risk, safety, quality and customer impact.\n• May make certain changes to the work plan as deemed necessary for the situation. Prepares a re- estimation of the work and /or adjusts the project plan as necessary.\n• Proactively prepares for emergency situations; supports company efforts during emergency situations; communicates deficiencies in emergency response/preparedness; resolves issues quickly and efficiently using the correct resources.\n• Provides current, direct, complete and “actionable” positive and corrective feedback to others. Regularly visits work sites to monitor progress and employee performance.\n• Reviews current work practices for operational efficiencies and deficiencies and provides feedback. Follows up, and recommends improvement to appropriate parties.\n• Supervises staff, including bargaining unit employees, to accomplish results through recruitment and selection, training and development, performance management, and rewards and recognition.\n• T200 Supervisors oversee up to 30 Linemen, Foremen. T300 Supervisors oversee up to 50 Lineman, Foreman\n\nQualifications\n\nMinimum:\n• High-School Diploma or GED\n• Minimum of five (5) years of relevant experience in engineering, manufacturing, construction, field maintenance operations, or related electric utility experience\n• Must obtain a California Driver’s License by first day of employment\n\n#featuredjob","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQWnp-MWL4Y5QjgS9CIeWIYawaB1J1wdwTNWqSS&s=0","location":"Stockton, CA","employmentType":"Full-time","datePosted":"8 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Pacific Gas And Electric Company - PG&amp;E","url":"https://jobs.pge.com/job/stockton/electric-distribution-general-construction-supervisor/29673/67474710672?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Indeed","url":"https://www.indeed.com/viewjob?jk=01c722270a608bea&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Glassdoor","url":"https://www.glassdoor.com/job-listing/electric-distribution-general-construction-supervisor-pge-corporation-JV_IC1147539_KO0,53_KE54,69.htm?jl=1009364224550&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"LinkedIn","url":"https://www.linkedin.com/jobs/view/electric-distribution-general-construction-supervisor-at-pacific-gas-and-electric-company-3974632470?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Jooble","url":"https://jooble.org/jdp/-6225365666698632478?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"ZipRecruiter","url":"https://www.ziprecruiter.com/c/Pacific-Gas-and-Electric-Company/Job/Electric-Distribution-General-Construction,-Supervisor/-in-Stockton,CA?jid=0b8e2091a1371a18&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"JobServe","url":"https://www.jobserve.com/us/en/extjob/ELECTRIC-DISTRIBUTION-GENERAL-CONSTRUCTION-SUPERVISOR-in-Stockton-California-USA-CC51C5512FF2856858/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"SimplyHired","url":"https://www.simplyhired.com/job/rMMRrpzfRTlrDRr_W-uabKhverXYbCdxUZ7RzV9ifk7KISdVCSS_lA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"cThZSjZzVk5wNFNTczJBTEFBQUFBQSUzRCUzRCUzQmVuZXJneSUyMFN0b2NrdG9uJTJDJTIwQ2FsaWZvcm5pYSUyMCUyMCUzQg==","title":"Energy Efficiency Specialist/HERS Rater- Opportunities to thrive!","company":"Energuy","description":"HERS Rater\n\nCompensation ranges from $45,000 to $80,000 plus vehicle, phone use reimbursement, and more...\n\nWilling to travel approximately 100%\n• Are you known for your obsessive punctuality?\n• Do you fill up your gas tank when it’s only half way empty?\n• Do you love fun competition?\n• Are your oil changes always done before it’s actually time to get it done?\n• Do you put your keys in the same spot every day?\n• Do you have to keep busy and moving all the time?\n• Do you have the need to take things apart to figure out how they work?\n• Do you like to have independence in your day?\n\nOur philosophy is that we can train anyone who has the right attitude, big dreams and the ability to follow through.\n\nIf this sounds like you, but you just haven’t had the right opportunity yet , you might have just found the right position!\n\nEnerguy is seeking Top Notch A Players to add to our growing team of Energy Professionals.\n\nOur Veteran HERS Raters mostly all started without any knowledge of the industry, but they are now experts in their field and key team players who carry out courteous, prompt and ethical HERS Ratings while continuing to pursue additional licenses and certifications.\n\nYou:\n• Passion for excellence in everything you do\n• Strong understanding of software systems, technology, Google Tools\n• Critical thinker who can analyze situations and make decisions\n• Ability to resolve challenges with a positive attitude\n• Have a \"YES\" mentality\n• Ability to juggle multiple projects with superb accuracy\n• High Energy\n• Results oriented/ Sets personal and professional goals consistently\n• Exceptional customer service/people skills, over the phone and in person, with our customers and internal departments\n\nYou will start by learning each department from the ground up. You’ll earn several certifications and be provided with close guidance and mentorship throughout a 6 month period. The more areas of our business you master, the higher your earning ability will be.\n\nSummary of Responsibilities:\n• Perform on-site inspections of residential buildings to assess energy efficiency and ensure compliance with Title 24 energy codes.\n• Conduct diagnostic tests, including blower door tests and duct leakage tests, to evaluate building performance.\n• Provide detailed documentation and reports on inspection findings, including potential energy efficiency upgrades.\n• Communicate inspection results and recommend energy-saving measures to contractors and homeowners.\n• Stay updated on California energy codes, standards, and best practices in energy efficiency.\n• Participate in ongoing training and professional development to maintain HERS Rater certification.\n• Ensure all documentation and reporting meet regulatory requirements and company standards.\n• Assist in the development and implementation of energy efficiency programs and initiatives.\n• Any other responsibilities as assigned to uphold Energuy's core values and vision.\n\nLearning/Training Milestone:\n• HVAC And Title 24: 90 days of apprenticeship/in field training\n• Advanced Title 24: 90-180 days\n• Home Energy Score : 120-180 days\n• Other licenses and certifications as desired\n\nKey Skills\n• Excellent verbal and written communication skills\n• Exceptional analytical, problem-solving and decision-making capabilities\n• Team player with the ability to work in a fast-paced environment while handling multiple priorities\n• Sound business ethics, including the protection of proprietary and confidential information\n• Ability to work overtime and weekends as needed\n• Take a natural interest in math\n• Ability to communicate effectively on a team, virtually, on the phone, in person and via email\n• STRONG INCLINATION TO LEARN\n\nAll offers of employment at Energuy are contingent upon clear results of a thorough background check and driving record review. Background checks will be conducted on all final candidates.\n\nJob Type: Full-time\n\nExperience:\n• Stable job history\n\nEducation:\n• High School or equivalent\n\nLicense:\n• drivers license with good driving record + 5 years of licensed driving experience / willingness to obtain all relevant licenses and certifications\n\nIf you are interested and want to move to the front of the line for an immediate interview, call us at 877-600-0123\n\nJob Type: Full-time\n\nPay: $45,000.00 - $80,000.00 per year\n\nBenefits:\n• Dental insurance\n• Flexible schedule\n• Health insurance\n• Life insurance\n• Paid time off\n• Referral program\n• Retirement plan\n• Vision insurance\n\nSchedule:\n• Monday to Friday\n• Weekends as needed\n\nSupplemental pay types:\n• Bonus opportunities\n\nEducation:\n• High school or equivalent (Preferred)\n\nExperience:\n• driving: 5 years (Required)\n\nLicense/Certification:\n• Driver's License (Required)\n\nWork Location: On the road\n\nJob Type: Full-time\n\nPay: $45,000.00 - $80,000.00 per year\n\nBenefits:\n• Flexible schedule\n• Paid time off\n• Retirement plan\n\nSchedule:\n• Monday to Friday\n• Weekends as needed\n\nSupplemental pay types:\n• Bonus opportunities\n\nEducation:\n• High school or equivalent (Preferred)\n\nExperience:\n• driving: 5 years (Required)\n\nLicense/Certification:\n• Driver's License (Required)\n\nAbility to Relocate:\n• Stockton, CA: Relocate before starting work (Required)\n\nWork Location: On the road","image":"","location":"Stockton, CA","employmentType":"Dental insurance","datePosted":"9 days ago","salaryRange":"45K–80K a year","jobProviders":[{"jobProvider":"Indeed","url":"https://www.indeed.com/viewjob?jk=2a9ba695260fe913&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Glassdoor","url":"https://www.glassdoor.com/job-listing/energy-efficiency-specialist-hers-rater-opportunities-to-thrive-the-energuy-JV_IC1147539_KO0,63_KE64,75.htm?jl=1009360226286&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"SimplyHired","url":"https://www.simplyhired.com/job/vqwGQUNtAYeXMAY2qSm0iJCZaesIfpjVvkTnxgPyE-762zWRQnLo3g?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"V1Z2VjFQd1JOeGNtR3YtdUFBQUFBQSUzRCUzRCUzQmVuZXJneSUyMFN0b2NrdG9uJTJDJTIwQ2FsaWZvcm5pYSUyMCUyMCUzQg==","title":"CDL-A Truck Driver - Home Daily - Earn Up to $110k/Year + Benefits","company":"Energy Jobline","description":"Job Description\n\nSysco is Now Hiring Local CDL-A Truck Drivers in Northampton, PA...\n\nHome Daily - Local Routes\n\nEarn Up to $110,000/Year*\n\nWe offer our colleagues the opportunity to grow personally and professionally, to contribute to the success of a dynamic organization, and to serve others in a manner that exceeds their expectations. We’re looking for talented, hard-working individuals to join our team. Come grow with us and let us show you why Sysco is at the heart of food and service.\n\nWant a Career With Sysco? Get started:\n• STEP ONE: Request info by submitting this form\n• STEP TWO: Complete the Sysco Workday application (provided upon completion of STEP ONE and takes 10-15 min)\n• STEP THREE: Connect with a Sysco talent specialist to discuss the available role (we'll contact you at the number provided)\n\nBenefits\n• Local routes - Home daily\n• Average $30.25 per hour\n• Earn up to $110,000 per year including base, overtime, and incentive pay*\n• Paid vacation and holidays\n• Ongoing job skills and leadership development training\n• Career growth opportunities – we promote from within!\n• New hires are eligible first day of the month following or coinciding with 31 days from the date of hire\n• Comprehensive healthcare benefits\n• Generous retirement benefits\n• Employee discount programs\n• Service recognition and employee rewards\n• Discounts on Sysco stock (SYY)\n• Referral &amp; Safety programs\n• Tuition reimbursement\n• Uniforms\n• More benefits, too many to name\n\n(*The pay range provided is not indicative of Sysco’s actual pay range but is merely algorithmic and provided for generalized comparison. Factors that may be used to determine rate of pay include specific skills, work location, work experience, and other individualized factors.)\n\nWant a Career With Sysco? - Complete the form and application today!\n\nJob Summary\n\nSysco has immediate job openings for dependable local CDL A Delivery Truck Drivers to safely and efficiently operate a tractor-trailer and manually unload/deliver various products (meats, produce, frozen foods, groceries, dry goods, supplies, etc.) to customer locations on an assigned route schedule. Our truck drivers build relationships with each customer using their positive, friendly attitude and become familiar with their operations to meet needs and expectations.\n\nQualifications\n• 1 year experience required\n• 21+ years of\n• Must submit to a pre-employment drug screen\n• License to drive - valid Class A Commercial Driver License (CDL) with a clean driving record\n• Ability to read, write, and communicate in English\n• Touch freight – may need to lift, push, or move product weighing an average of 40-60 pounds and as much as 100 pounds\n• Flexibility – overtime as required, occasional weekends and holiday\n\nSysco is an Equal Opportunity Employer: All qualified applicants will receive consideration for employment without regard to , , , , , status, protected veteran status, or other characteristics protected by law","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTeVdDPEzQODlnTO_q7z-2QjzZObsXqNwFAdyVQ&s=0","location":"Stockton, CA","employmentType":"Health insurance","datePosted":"12 hours ago","salaryRange":"","jobProviders":[{"jobProvider":"LinkedIn","url":"https://www.linkedin.com/jobs/view/cdl-a-truck-driver-home-daily-earn-up-to-%24110k-year-%2B-benefits-at-energy-jobline-3978318784?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"ekZvYWNISWh1RFhtNGNka0FBQUFBQSUzRCUzRCUzQmVuZXJneSUyMFN0b2NrdG9uJTJDJTIwQ2FsaWZvcm5pYSUyMCUyMCUzQg==","title":"Fuel Buyer","company":"DTE Energy","description":"DTE is one of the nation’s largest diversified energy companies. Our electric and gas companies have fueled our customer’s homes and Michigan’s progress for more than a century. And as Michigan’s largest source of renewable energy, we’re creating a cleaner, healthier environment to power our future. We’re also serving communities beyond Michigan, where our affiliated businesses offer renewable... energy, emission control technologies, and energy services to industries in 19 states. But we’re more than a leading energy company... and working at DTE is more than just a job. At DTE, we take great care of each other and our customers, and we use our energy to be a force for growth and prosperity in our communities. When you join us, you’ll be part of a team that welcomes, recognizes, and celebrates differences, and values everyone’s health, safety, and wellbeing. Are you ready to make that kind of difference? Bring your energy to DTE. Together, we can achieve great things. The pay range for this position is $96,600.00 - $118,600.00.\n\nJob Summary\n\nLocation: Stockton, CA\n\nOffering a $5,000 signing bonus to the successful candidate.\n\nThe position will assist the Plant Manager, Asset Management, and Operations teams in identifying, structuring, sourcing, negotiating, procuring, and transporting of biomass fuel consisting of agricultural and urban waste materials for their assigned facility. In addition, this position will be responsible for ensuring cost effective ash disposal in conjunction with the ash management plan.\n\nThe Fuel Buyer is responsible for working with both internal and external stakeholders to develop multiple vendors for fuel supply and disposal or beneficial reuse of ash. This person is expected to develop, update, and maintain the fuel and ash plans for the duration of the power purchase agreement and ensure that performance is consistent with the plans. This position is also responsible for administering the fuel procurement software (3log) for proper vendor payments and consistent quality, inventory, and financial data reporting.\n\nThe Fuel Buyer is expected to ensure fuel quality standards are met, optimize plant performance, and support fuel yard management to ensure efficient and reliable operation from the receipt of fuel through the delivery of fuel to the boiler. In addition, this person is responsible to monitor and ensure ash silo levels are managed to optimize trucking and disposal costs while meeting operational requirements for capacity.\n\nThe Fuel Buyer will be expected to comply with all DTE Vantage safety processes, the DTE Code of Conduct and the On-=Site Energy BU Administrative Guidelines.\n\nKey Accountabilities\n• Ensure that the plant has adequate supplies of fuel to sustain reliable operation. Fuel must meet quality and cost expectations\n• Ensure onsite and third-party quality testing and fuel sampling and reporting are performed as scheduled and reviewed and distributed to all applicable parties\n• Develop fuel plan with detailed annual forecast and budget for ash and fuel, updated quarterly; include 5-year market forecast developed in conjunction with asset management\n• Identify, implement, and ensure low-cost disposal or beneficial reuse options for ash\n• Negotiate with counterparties to successfully structure procurement, transportation, storage, and other commercial agreements needed to satisfy fuel and ash plans and actively manage contracts to ensure counterparty performance and maximize value creation\n• Verify accounts receivable and accounts payable relating to fuel procurement and ash disposal\n• Administer 3log software and perform analysis of fuel supply to ensure proper material tracking for both quality and cost. Develop and distribute relevant reports to stakeholders\n• Perform inspections and quality control assessments of fuel suppliers at their location on a frequent and unplanned basis to ensure processes meet quality requirements\n• Coordinate and manage invasive species programs, including compliance plans as appropriate to support the overall approved fuel plan\n• Control fuel inventory (onsite, offsite and vendor owned) to support plant operations including pile management to comply with industry best practices and environmental permit limits\n• Establish and oversee process to ensure all fuel suppliers and transportation providers have the proper insurance requirements and records are maintained. Enforce compliance with safety and environmental standards when on site\n• Manage beneficial reuse of ash planning and development in coordination with plant leadership, EH&amp;S Specialist, and Environmental\n• Schedule quarterly/annual ash testing to minimize cost impact of disposal to coincide with planned outages\n• Performs all other related duties as assigned\n\nMinimum Education &amp; Experience Requirements\n• High School Diploma or equivalent and knowledge and capabilities typically acquired through at least 5 years of relevant professional experience, or\n• Associate degree or industry-recognized certificate (i.e., the completion of a core group of course designated by the institution) in a related discipline is preferred and knowledge and capabilities typically acquired through at least 3 years of relevant professional experience, or\n• Bachelor’s degree in a related discipline with a minimum of 2 years of relevant professional experience\n\nOther Qualifications\n• The candidate should have a commercial background and be familiar with various aspects of the agricultural practices, wood recycling/processing, and wood transportation industry\n• Proven ability to develop and maintain strong relationship with wood suppliers, transporters, and recovery customers\n• Knowledge of power plant fuel management procedures and processes\n• Demonstrated history of developing and crafting fuel procurement and transportation agreements or similar contracts\n• Experience managing waste recovery yards or fuel yards desired\n• Excellent written and oral communication skills, with the ability to analyze and communicate tasks, needs, activities, and follow-up actions to relevant stakeholders\n• Ability to take initiative and prioritize competing priorities\n• Team player, ability to lead and/or work within cross-functional teams\n• Ability to travel as necessary in the local area daily and overnight up to 15%\n• Ability to function and when necessary to influence others within a matrix organization in which functional and business leaders have equal authority within the organization and employees report to both a functional leader and a business leader\n\nPhysical Demands &amp; Working Conditions\n\nThe physical demands characterized here epitomize those that must be met by an employee to properly perform the integral functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. In order to properly perform the integral functions of this job, the employee is required to:\n• Occasionally stand or walk and stoop or kneel. Frequently, the employee is required to sit\n• Talk or hear, both in person and by telephone; use wrists, hands and/or fingers in a repetitive motion; and reach with hands and arms extensively\n• Occasionally lift objects of up to 50 pounds in weight\n• Use computers with exposure to video display terminals; and some repetitive motion associated with data entry, the use of a computer mouse, and while using other office equipment\n• Vision requirements for this position include close vision, color vision, depth perception and the ability to adjust focus\n\nThe employee performs job duties in a business office setting from a climate-controlled office environment, with a moderate noise level, and at an industrial site, where the noise level is moderate to loud. The individual may also be exposed to chemicals and odors consistent with waste materials. The individual may at times work near mechanical moving parts. They may work in elevated areas, around fumes or airborne particles, outdoor weather conditions and extreme heat. The individual may spend many hours driving as stakeholders may be broadly dispersed over a large geographical area.\n\nAdditional Information\n\nIncumbents may engage in all or some combination of the activities and accountabilities, and utilize a variety of the competencies cited in this description depending upon the organization and role to which they are assigned. This description is intended to describe the general nature and level of work performed by incumbents in this job. It is not intended as an all-inclusive list of accountabilities or responsibilities, nor is it intended to limit the rights of supervisors or management representatives to assign, direct and control the work of employees under their supervision.\n\nPRIVACY NOTICE TO CALIFORNIA JOB APPLICANTS\n\nAt DTE Energy, we are committed to providing an inclusive workplace where everyone feels welcome and a sense of belonging. We seek individuals with a heart for service, a passion to help our communities prosper, and ideas to help shape the future of energy. We are proud to be an equal opportunity employer that considers all qualified applicants without regard to race, color, sex, sexual orientation, gender identity, age, religion, disability, national origin, citizenship, height, weight, genetic information, marital status, pregnancy, protected veteran status or any other status protected by law","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQEAUnAZGsltBWtzaHx321mFIk8DrjiB9hJ-zjX&s=0","location":"Stockton, CA","employmentType":"Full-time","datePosted":"1 day ago","salaryRange":"","jobProviders":[{"jobProvider":"DTE Energy Careers","url":"https://careers.dteenergy.com/job/Stockton-Fuel-Buyer-CA-95201/1112601400/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"ZipRecruiter","url":"https://www.ziprecruiter.com/c/DTE-Energy/Job/Fuel-Buyer/-in-Stockton,CA?jid=fe80281db881795e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Indeed","url":"https://www.indeed.com/viewjob?jk=1f0b9ea888895a42&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Glassdoor","url":"https://www.glassdoor.com/job-listing/fuel-buyer-dte-energy-JV_IC1147539_KO0,10_KE11,21.htm?jl=1009049179646&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Jooble","url":"https://jooble.org/jdp/3107502094704169028?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Power Industry Jobs","url":"https://powerindustryjobs.com/job/fuel-buyer-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Adzuna","url":"https://www.adzuna.com/details/4502225853?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Talent.com","url":"https://www.talent.com/view?id=0632b5305948&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"dXd1cnlGWXJxZnV0RndUR0FBQUFBQSUzRCUzRCUzQmVuZXJneSUyMFN0b2NrdG9uJTJDJTIwQ2FsaWZvcm5pYSUyMCUyMCUzQg==","title":"Supervisor - High Energy Piping / Pressure Parts","company":"UGL Pty Limited","description":"Job Description - Supervisor - High Energy Piping / Pressure Parts (260373)\n\nSupervisor - High Energy Piping / Pressure Parts - 260373...\n\nWe work on challenging and exciting projects that shape the way we evolve, adapt, and transform the industries we work in. We rally together, drawing on the diverse skills across our teams and create environments where great ideas are heard.\n\nThis opportunity will see you join a reputable company with a highly experienced team who work together to develop and provide solutions for our customers.\n\nUGL’s Industrial &amp; Resources division are currently seeking experienced High Energy Piping / Pressure Parts Supervisors to join the team for an upcoming outage at Eraring Power Station, Lake Macquarie NSW. The role will commence Mid-August\n• Approx 14-week Duration\n• 6 Days Per Week\n• Plenty of OT on offer\n• LAFHA Allowance and accommodation provided for Eligible applicants\n\nHere are the essentials you'll need for this role:\n• Experience working in a shutdown environment – Highly regarded\n• Experience in High Energy Piping or Pressure Parts essential\n• White Card\n• Confined Space &amp; Gas Test Atmosphere qualifications – completed within 3 years\n• Working at Heights\n• Trade Qualified – Boilermaker\n• Cert 10 – Highly regarded\n• Piping experience is essential\n\nWhat we offer:\n• Diverse opportunities to grow, back yourself and achieve\n• A strong portfolio of work for 2024 – 2025 across multiple market sectors and regions\n• The chance to join a 6,000+ strong organisation owned by the CIMIC Group, one of the world's leading international contractors\n• Pathways for you to succeed and the space for you to carve your own journey\n• A culture that values diversity and innovation, evolving with market changes and new technologies\n\nWhat makes you right for UGL:\n• Genuine concern for safety\n• Ability to provide a safe, supportive and positive workplace\n• Capacity to flourish in a high-performance environment\n• An innovative mindset and a willingness to challenge the norm\n• A belief that success and value are driven by real teams where everyone has a role to play\n\nAbout Us\n\nUGL is well-known and respected for providing end-to-end engineering, construction and maintenance services within, rail and transport, communications and technology systems, oil and gas, power, renewables and resources, water and defence markets. UGL partners with some of the world’s largest blue-chip companies and government agencies, private enterprises and public institutions. We are a member of the CIMIC Group of companies.\n\nAt UGL, we value diversity – in the backgrounds, ideas, work styles and perspectives of our team. We are an Equal Opportunity Employer and strongly encourage people with disability, Aboriginal &amp; Torres Strait Islander people, mature aged workers and people from culturally diverse backgrounds to apply.\n\nPlease note that relevant screening checks will be conducted as part of the recruitment process. These may include a national criminal history check and for you to undergo pre-employment medical assessment including drug and alcohol screen.\n\nIf you are confident you have the skills and knowledge to fulfill this role, then please apply now.\n\nDiversity and Inclusion is a priority at UGL, so we welcome applications from all backgrounds regardless of gender, age, disability or ethnicity. Women, Aboriginal and Torres Strait Islanders and people with a multicultural background are strongly encouraged to apply.\n\n#unitewiththeverybest #comeworkwithus\n\nPrimary Location:\n\nAustralia-NSW-Newcastle, Maitland &amp; Hunter\n\nWork Type:\n\nCasual\n\n#J-18808-Ljbffr","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSW-CpyZXtrm50HGrSGuU7Q9h3Kfb6EnXdMSGuY&s=0","location":"Stockton, CA","employmentType":"Full-time","datePosted":"6 days ago","salaryRange":"","jobProviders":[{"jobProvider":"CareerBuilder","url":"https://www.careerbuilder.com/job/J3M0FC63RTYX647ML7T?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"ZmhzYno1b0FoUVBMWXNrYUFBQUFBQSUzRCUzRCUzQmNsaW1hdGUlMjBTdG9ja3RvbiUyQyUyMENhbGlmb3JuaWElMjAlMjAlM0I=","title":"Commercial Refrigeration &amp; HVAC Tech","company":"Climate Pros","description":"Job Summary\n\nThe Refrigeration Service Technician will enjoy working independently as a representative of Climate Pros. performing work in the maintenance, troubleshooting, diagnosis, and repair of refrigeration electrical, mechanical, and microprocessor control systems commonly installed in supermarkets and single systems, parallel racks systems, display cases, and walk-in boxes. The technician... will perform prescribed, routine maintenance, leak detection procedures, and service calls resulting in outstanding customer satisfaction.\n\nPrior to working independently, a Service Technician may work closely with the team to learn how to repair, install, troubleshoot, and perform preventive maintenance. Climate Pros offers training programs to build on existing technical skills and develop the skills necessary to work in this highly sought-after skilled trade.\n\nDuties and Responsibilities:\n• Provide knowledgeable and courteous repair service.\n• Maintain high-quality customer service and care.\n• Provide timely and quality repairs.\n• Provide detailed notes and pictures in all dispatches assigned.\n• Follow company policy on all check-in and check-out procedures with all customers.\n• Keep a clean, organized truck.\n• Travel and on-call are required.\n\nPlease note that this job description is not designed to cover or contain a comprehensive listing of activities, duties, or responsibilities required of the employee for this job. Duties, responsibilities, and activities may change at any time, with or without notice.\n\nDesired Skills, Certifications, and Education:\n• Excellent communication skills.\n• Time management skills.\n• Team player who can ensure fast, reliable, and expert service to every customer.\n• Mechanical aptitude.\n• Ability to follow directions and specific process steps to ensure quality workmanship.\n• Self-sufficient and able to work with little direct supervision.\n• Flexibility to work variable and flexible hours, including overtime.\n• Must possess and maintain a valid state driver's license.\n• High school diploma or general education degree (GED).\n• EPA Certification: Universal.\n• Supermarket refrigeration/freezer experience or warehouse refrigeration is an asset.\n• Experience with Novar, CPC, Danfoss Energy Management Controls, and Rack Refrigeration is a plus.\n• Perform other related duties as required and assigned.\n• Be an honest team player, growth-oriented, ability to do whatever it takes; safely!\n\nPhysical Requirements and Working Conditions:\n\nRegularly required to stand; walk; climb; carry; bend; kneel; reach; push; pull; occasionally lift and/or move up to 75 pounds; noise level is medium/low.ia\n\nRequirements:\n\nClimate Pros is an equal opportunity employer committed to creating a diverse and inclusive workplace. We value and celebrate the unique perspectives and contributions of individuals, and we prohibit discrimination and harassment based on any protected characteristic as defined by applicable federal, state, and local laws","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRB7irKeco0zAN7yv98xYJzmroXQ6wKjQi-_qkD&s=0","location":"Stockton, CA","employmentType":"Full-time","datePosted":"14 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Glassdoor","url":"https://www.glassdoor.com/job-listing/commercial-refrigeration-hvac-tech-climate-pros-JV_IC1147539_KO0,34_KE35,47.htm?jl=1009313109857&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Indeed","url":"https://www.indeed.com/viewjob?jk=9c73d4ec83f41342&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"SimplyHired","url":"https://www.simplyhired.com/job/Dv2xoss_2Mwwja7FRpuZ4hlivBSvmJyDH8fNQvAVys6o7PqJQ0g-Gw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"a2FiLV9YMkhDVlJVWDhGdEFBQUFBQSUzRCUzRCUzQmNsaW1hdGUlMjBTdG9ja3RvbiUyQyUyMENhbGlmb3JuaWElMjAlMjAlM0I=","title":"Climate Control Specialist (HVAC)","company":"Vallejo City Unified School District","description":"VALLEJO CITY UNIFIED SCHOOL DISTRICT\n\nHuman Resources...\n\n665 Walnut Avenue, Vallejo, CA 94592\n\nClimate Control Specialist\n\nTitle: Climate Control Specialist\n\nReports To: Maintenance and Grounds Manager\n\nDepartment: Maintenance &amp; Grounds\n\nWork Year: 260 Days per year\n\nClassification: Classified\n\nSalary: Classified Salary Schedule\n\nDate Approved: January 2010\n\nDESCRIPTION OF POSITION:\n\nUnder the direction of the Maintenance Manager or designated Manager, perform skilled mechanical and electrical work in the inspection, service, installation, repair and alteration of existing heating, air-conditioning units including but not limited to boilers, air ducts and refrigeration systems and all related equipment.\n\nREPRESENTATIVE DUTIES:\n• Install, service, maintain, troubleshoot and repair HVAC units, boilers, refrigeration and freezing equipment as required.\n• Diagnose, test and determine repair needs and requirements for defective units and parts.\n• Inspect, repair, maintain, and replace reciprocating and centrifugal compressors. Clean and rod boilers, maintain and service water towers, closed water systems, steam systems, water pumps and other related equipment.\n• Repair, install, and maintain pneumatic control systems, including air compressors, low and high voltage control systems and related sensory instrumentation and controls for appropriate air flow,\n• Service, repair, maintain and replace furnace filters, air blowers, exhaust fans, ventilators, coolers, gas valves and other related heating equipment.\n• Test systems and joints, insulate pipes and duct work pertaining to heating ventilation systems,\n• Fabricate, repair and install metal and various types of duct work, panels and covers,\n• Operate and maintain a variety of specialized hand and power tools and equipment,\n• Install, repair and replace window units, heat pumps, DX and complex MZ units, maintain low and high pressure chilling equipment.\n• Service, repair and maintain walk-in freezers, domestic and commercial food storage refrigerators, ice machines, water and beverage coolers and other related equipment,\n• Assure work completed and in progress complies with applicable EPA laws, rules and regulations.\n• Must have a basic understanding of and be able to use a personal lap top computer. Be able to use the \"Alerton Bactalk\" computer program and understand the energy management system as it relates to HVAC equipment.\n• Drive and operate a District value to conduct work.\n• Perform other related duties as assigned.\n\nEDUCATION AND CREDENTIALS:\n• High School diploma or GED, and training equivalent to HVAC and refrigerant mechanic apprenticeship program and five years of journeymen level HVAC and refrigerant experience\n\nLICENSE:\n• Must have appropriate California Drivers License and be insurable by the Districts insurance carrier\n• Must have a valid EPA Refrigerant Recycling Certification.\n\nPHYSICAL REQUIRMENTS:\n\nFrequency Key; None (1) Occasional - up to 25% of shift (2); Intermittently - up to 50% of shift (3); Frequently — up to 75% of shift (4)\n\nActivity Frequency\n\nBend 2\n\nLift/carry 0-10 lbs 2\n\nTwist 2\n\nLift/carry 11-25 lbs 2\n\nSquat 2\n\nLift/carry 26-40 lbs 2\n\nKneel 2\n\nLift/carry 41-100 lbs\n\nClimb 2\n\nStand 3\n\nReach above shoulder 2\n\nWalk 3\n\nGrip/Grasp 4\n\nSit 4\n\nExtend/Flex Neck 3\n\nDrive 3\n\nUse Right Hand 4\n\nPerform Repetitive Hand Motions 4\n\nUse Left Hand 4\n\nKeyboarding/Mouse Work 4\n\nAbility to See 4\n\nAbility to Hear 4\n\nTHE VALLEJO CITY UNIFIED SCHOOL DISTRICT IS AN EQUAL OPPORTUNITY EMPLOYER and in compliance with federal and state laws, does not discriminate in any employment practice on the basis of age, ancestry, color, marital status, medical condition, national origin, political or union affiliation, physical or mental disability, race, religion, sexual orientation or sex. The District is in compliance with ADA requirements.\n\nExplore Careers at Vallejo City Unified School District\n\nThank you for your interest in the Vallejo City Unified School District!\n\nVallejo has a growing population of more than 125,000 residents of diverse ethnic and cultural backgrounds. Residents and visitors alike comment on Vallejo's rich history combined with its small-town feel. Many residents are the third and fourth generations to live in Vallejo, while newcomers arrive every day.\n\nAre you looking to join a qualified, passionate, and committed team who works hard every day to change the lives of students in this diverse community? If so, Vallejo City Unified is the right fit for you!\n\nKeywords: Teacher Jobs Near Me, School Teacher Jobs Near Me, High School Teacher Jobs Near Me, Middle School Teacher Jobs Near Me, Tutor Jobs Near Me, Grade Teacher Jobs Near Me, Classroom Teacher Jobs Near Me, Combo Teacher Jobs Near Me, English Teacher Jobs Near Me, Math Teacher Jobs Near Me, Science Teacher Jobs Near Me, Elementary Teacher Jobs Near Me","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR5bAJo6Qy2oI4ChDV0Xf_Csiq2-qvBFk-Xe7IQ&s=0","location":"Stockton, CA","employmentType":"Full-time","datePosted":"7 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Dream Jobs Hire","url":"https://dreamjobshire.com/job-listing/vallejo-city-unified-school-district-climate-control-specialist-hvac-ahsfc8b4s16j-5eab17db0b66df6e0-4e1f70891c2f734?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Employ Sector","url":"https://employsector.com/viewjoblistings/vallejo-city-unified-school-district/california-stockton-climate-control-specialist-hvac-of598l4ytm6d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"YXpTQXBtaWRNaGpSREN3cEFBQUFBQSUzRCUzRCUzQmNsaW1hdGUlMjBTdG9ja3RvbiUyQyUyMENhbGlmb3JuaWElMjAlMjAlM0I=","title":"Budget Analyst","company":"U.S. Fish and Wildlife Service","description":"JOB SUMMARY: This position is a Budget Analyst, GS- 0560-7/9 working in Lodi, California for the R8-Lodi Fish and Wildlife Office. MAJOR DUTIES: As a Budget Analyst your duties will include but are not limited to the following: Responsible for the performance of budgetary functions and duties associated with all phases of the budget process (e.g., formulation, justification, presentation, and execution) within the assigned business team. Monitors the use and rate of expenditure of assigned budgets using computerized reports, dialogue with members of business team (program managers, project leaders, and support staff), review of written documents, and examination of accounting records. Provides administrative support functions to assigned duty station and maintains physical and automated records, reports, guidelines, and various office correspondence. IMPORTANT: Click the 'Apply for this job' button to view a complete job description.","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQXwwpeXiEox_YFuC0ryv4uL4AN_gjvg4Fzvaxp&s=0","location":"Lodi, CA","employmentType":"Full-time","datePosted":"4 days ago","salaryRange":"61,023–97,034 a year","jobProviders":[{"jobProvider":"Climate Change Jobs","url":"https://climatechangejobs.com/jobs/68114380-budget-analyst?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"N3l2ZU9iTHhKdk84d2tVRUFBQUFBQSUzRCUzRCUzQmNsaW1hdGUlMjBTdG9ja3RvbiUyQyUyMENhbGlmb3JuaWElMjAlMjAlM0I=","title":"Shipping Coordinator, Megafactory","company":"Tesla","description":"What to Expect\n\nThe Shipping Coordinatorwill be...\nresponsible for entering alphabetic, numeric, or symbolic data from source\ndocuments a web-based database. Compare data entered with source documents, corrects\nentered data if necessary. May compile, sort, and verify accuracy of data to be\nentered.\n\nWhat You’ll Do\n• Entry of data into web-based database program in compliance with\nestablished policies and procedures\n• Ensure timely and accurate processing of all designated data entry.\n• Identify discrepant data both in writing and verbally to supervisor.\n• Filing, copying, and other general clerical duties as necessary\n• Utilize TMS , MFS, and Warp and be able to verify create and reject\nshipments systematically\n• Maintain a clean and orderly work area\n\nWhat You’ll Bring\n• Strong detail orientation\n• Excellent data entry skills required, including touch typing and\n10-key\n• Experience handling high-volume, sensitive, routine work. · 2-4 years\nof Data Entry experience\n• Excellent organizational skills\n• Strong written and verbal communication skills\n• Able to work in a fast-paced environment\n• Able to process\nin bound email request quickly\n• After attaining\nunderstanding of work flow; able to work efficiently in the team to chase data\ngaps\n• Work closely with corresponding Tesla\nLogistics Analyst- ensuring open communications, and a complete understanding of\nshipping cadences and procedures\n• Requires very\nstrong Microsoft Excel background including pivot tables, vlookups, index\nmatch, etc.\n\nOther\nrequirements\n• · Must be able to walk around and or sit 8-10\nhours a day\n• Must be able to lift 20 lbs. with consistency\nevery day.\n• Must be willing to work in various weather\nconditions (for yard audits)\n• Must have knowledge on trailers careers,\nability to learn systematic tracking of trailers and deliveries","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT5Tp7sNBf7L-6JOdp9DdX9VQzPD5y2cQouq6vv&s=0","location":"Lathrop, CA","employmentType":"Full-time","datePosted":"23 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Climate Change Jobs","url":"https://climatechangejobs.com/jobs/64496696-shipping-coordinator-megafactory?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Jobtrees","url":"https://www.jobtrees.com/postid/08bebc57cc3739da970fbe60aed3db31?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Lathrop, CA - Geebo","url":"https://lathrop-ca.geebo.com/jobs-online/view/id/1342342429-shipping-coordinator-/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"OGRLOW9vZVRlVDdxZVhrSUFBQUFBQSUzRCUzRCUzQmVsZWN0cmljJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Industrial Electrician","company":"Pearl Electric Inc","description":"Responsibilities:\n- Install, maintain, and repair electrical systems and equipment in commercial and residential settings\n- Read and interpret blueprints, schematics, and wiring diagrams to determine the layout and installation of electrical systems...\n- Inspect electrical components, such as transformers and circuit breakers, to identify hazards or defects\n- Diagnose and troubleshoot electrical malfunctions using testing devices\n- Perform routine maintenance on electrical systems to ensure their efficiency and safety\n- Collaborate with other tradespeople, such as plumbers and carpenters, to complete projects requiring multiple skill sets\n- Adhere to all safety regulations and guidelines while performing electrical work\n\nExperience:\n- Minimum of 5 years of experience as a Journeyperson Electrician\n- Proficient in building and installing electrical systems, including logic controllers and commercial wiring\n- Strong knowledge of the National Electrical Code (NEC) and ability to apply it in daily work\n- Skilled in using hand tools, power tools, and testing equipment for electrical installations and repairs\n- Experience with renovating existing electrical systems in industrial and commercial buildings\n- Ability to read blueprints and schematics accurately to determine the layout of electrical systems\n\nMust have your own tools and have a clean driving record.\n\nIf you are a skilled Journeyperson Electrician with experience in commercial electrician work, we want to hear from you. Join our team of dedicated professionals and contribute your expertise to various projects. We offer competitive pay rates and opportunities for career growth. Apply now!\n\nJob Type: Full-time\n\nPay: $32.00 - $40.00 per hour\n\nExpected hours: 40 – 50 per week\n\nBenefits:\n• 401(k) 3% Match\n• Dental insurance\n• Health insurance\n• Paid time off\n• Vision insurance\n\nCompensation package:\n• Hourly pay\n\nSchedule:\n• 8 hour shift\n\nExperience:\n• Industrial: 2 years (Preferred)\n• electrical: 5 years (Required)\n\nLicense/Certification:\n• Journeyman Electrician's license (Preferred)\n\nWork Location: In person","image":"","location":"Stockton, CA","employmentType":"Dental insurance","datePosted":"3 days ago","salaryRange":"32–40 an hour","jobProviders":[{"jobProvider":"Indeed","url":"https://www.indeed.com/viewjob?jk=0c03477010ecc6f5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Glassdoor","url":"https://www.glassdoor.com/job-listing/industrial-electrician-pearl-electric-inc-JV_IC1147539_KO0,22_KE23,41.htm?jl=1009367376037&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"WnlWYmlyUDVsZkp3MnpHa0FBQUFBQSUzRCUzRCUzQmVsZWN0cmljJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Electric Distribution General Construction, Supervisor","company":"PG&amp;E Corporation","description":"Requisition ID # 158755\n\nJob Category: Maintenance / Construction / Operations...\n\nJob Level: Supervisor\n\nBusiness Unit: Electric Operations\n\nWork Type: Onsite\n\nJob Location: Stockton\n\nDepartment Overview\n\nThe Coworkers of Electric Operations ensure the delivery of safe and reliable electric service to our customers. Electric Operations is responsible for every aspect of PG&amp;E's electric distribution and transmission operations, including planning, engineering, maintenance and construction, asset management, business planning, restoration and emergency response.\n\nPosition Summary\n\nManages teams involved in maintaining or building parts, command &amp; control outage response, and monitoring and restoration efforts of the system-wide service territory distribution grid. Provides safe and reliable electric service while maintaining compliance with the California Public Utility Commission (CPUC) General Orders, and all procedures and safety regulations and other regulatory requirements.\n\nAnalyze and prioritize outages to determine most efficient restoration needs. Implements safety policies and best practices and manages employee’s accountability. Ensures full compliance with the Injury &amp; Illness Prevention Programs.\n\nPG&amp;E is providing the salary range that the company in good faith believes it might pay for this position at the time of the job posting. This compensation range is specific to the locality of the job. The actual salary paid to an individual will be based on multiple factors, including, but not limited to, specific skills, education, licenses or certifications, experience, market value, geographic location, and internal equity. Although, we estimate the successful candidate hired into this role will be placed towards the middle or entry point of the range, the decision will be made on a case-by-case basis related to these factors.\n\nA reasonable salary range is:​\n\nAnnual Minimum: $123,000.00\n\nAnnual Maximum: $197,000.00\n\nJob Responsibilities\n• Builds constructive and effective relationships using diplomacy and treats direct reports equitably. Completes and maintains all work documentation or reporting.\n• Develops and maintains regional contacts and Interacts with local government. Develops, reviews and/or executes action plans to address deficiencies in process or employee skill/knowledge and track the progress of those plans.\n• Effectively uses resources by monitoring crew productivity. Efficiently and accurately performs monitoring and analysis functions for ongoing projects and work efforts.\n• Ensures maintenance and construction work is completed on time and within budget and quality expectations, while monitoring compliance to standards and specifications.\n• Ensures that customers' needs and expectations are met. Provides clear, professional, proactive communication with customers in a variety of field situations during the project, while ensuring regulatory compliance and safety.\n• Facilitates or leads weekly team meetings/tailboards. Conducts training as needed.\n• Identifies and pursues productivity improvements and implements work practices to reduce operating costs while meeting corporate and regulatory compliance.\n• Identifies and reacts to complex field decisions, using technical knowledge and experience to move forward quickly, considering cost, risk, safety, quality and customer impact.\n• May make certain changes to the work plan as deemed necessary for the situation. Prepares a re- estimation of the work and /or adjusts the project plan as necessary.\n• Proactively prepares for emergency situations; supports company efforts during emergency situations; communicates deficiencies in emergency response/preparedness; resolves issues quickly and efficiently using the correct resources.\n• Provides current, direct, complete and “actionable” positive and corrective feedback to others. Regularly visits work sites to monitor progress and employee performance.\n• Reviews current work practices for operational efficiencies and deficiencies and provides feedback. Follows up, and recommends improvement to appropriate parties.\n• Supervises staff, including bargaining unit employees, to accomplish results through recruitment and selection, training and development, performance management, and rewards and recognition.\n• T200 Supervisors oversee up to 30 Linemen, Foremen. T300 Supervisors oversee up to 50 Lineman, Foreman\n\nQualifications\n\nMinimum:\n• High-School Diploma or GED\n• Minimum of five (5) years of relevant experience in engineering, manufacturing, construction, field maintenance operations, or related electric utility experience\n• Must obtain a California Driver’s License by first day of employment\n\n#featuredjob","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQWnp-MWL4Y5QjgS9CIeWIYawaB1J1wdwTNWqSS&s=0","location":"Stockton, CA","employmentType":"Full-time","datePosted":"8 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Pacific Gas And Electric Company - PG&amp;E","url":"https://jobs.pge.com/job/stockton/electric-distribution-general-construction-supervisor/29673/67474710672?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Indeed","url":"https://www.indeed.com/viewjob?jk=01c722270a608bea&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Glassdoor","url":"https://www.glassdoor.com/job-listing/electric-distribution-general-construction-supervisor-pge-corporation-JV_IC1147539_KO0,53_KE54,69.htm?jl=1009364224550&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"LinkedIn","url":"https://www.linkedin.com/jobs/view/electric-distribution-general-construction-supervisor-at-pacific-gas-and-electric-company-3974632470?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Jooble","url":"https://jooble.org/jdp/-6225365666698632478?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"ZipRecruiter","url":"https://www.ziprecruiter.com/c/Pacific-Gas-and-Electric-Company/Job/Electric-Distribution-General-Construction,-Supervisor/-in-Stockton,CA?jid=0b8e2091a1371a18&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"JobServe","url":"https://www.jobserve.com/us/en/extjob/ELECTRIC-DISTRIBUTION-GENERAL-CONSTRUCTION-SUPERVISOR-in-Stockton-California-USA-CC51C5512FF2856858/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"SimplyHired","url":"https://www.simplyhired.com/job/rMMRrpzfRTlrDRr_W-uabKhverXYbCdxUZ7RzV9ifk7KISdVCSS_lA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"bGJfWEJCSi16RHQwb28tWkFBQUFBQSUzRCUzRCUzQmVsZWN0cmljJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Electrical Journeyman","company":"National Power, LLC","description":"Summary\nNational Power, LLC is actively seeking an experienced Electrical Journeyman. Under the general direction of and reporting to the Broadband Service Manager, you will play a pivotal role in installing, troubleshooting, and repairing electrical systems in diverse settings\n...\nThe ideal candidate will possess not only technical expertise but also a positive attitude, strong teamwork skills, and a commitment to safety.\n\nEssential Duties and Responsibilities\nCore duties and responsibilities include the following. Other duties may be assigned.\n• Inspect, troubleshoot, and repair commercial and industrial electrical systems.\n• Skillfully terminate electrical panels, circuit breakers, and transformers, ensuring proper connections and compliance with electrical codes.\n• Read and interpret electrical blueprints and manufacturer's specifications, ensuring accurate implementation of project requirements.\n• Complete preventative maintenance on electrical and grounding systems, including measuring, and recording voltages, amperages, and resistances. Use a thermal imaging camera to verify and troubleshoot potential issues.\n• Inspect electrical components for wear and corrosion.\n• Troubleshoot electrical systems and devices effectively, identifying and resolving issues to maintain optimal functionality.\n• Complete all job-related documentation in detail, including project reports, installation records, and other relevant paperwork. Submit completed documentation to the local manager.\n• Work collaboratively with team members, contractors, and other stakeholders to ensure smooth coordination and execution of electrical installations.\n• Adhere to all safety regulations and guidelines, promoting a culture of safety awareness on job sites and during all electrical installations.\nEducation &amp; Requirements\n• A high school diploma or GED; Completion of four-year electrical apprenticeship is preferred.\n• Possess 5+ years of experience in commercial electrical installation, covering Tenant Improvements (TI’s) and Ground-Up Construction from project initiation to completion.\n• Demonstrate familiarity with OSHA and NFPA70 regulations, as well as standard electrical safety practices.\nSkills and Other Qualifications\n• Must have excellent communication skills and be able to give verbal/written reports of job status, repair recommendations, equipment/supplies needed.\n• Must have an excellent driving record and a valid driver's license. The job WILL require driving long distances to job sites. Overnight stays in hotels up to 3 nights per week are required. The company will cover hotel costs and provide a meal allowance per company guidelines. The overnight preventive maintenance has a schedule from 12:00 AM to 6:00 AM.\n• Must have good computer skills and be comfortable with Microsoft software to include Internet Explorer, Word, Excel, and Adobe (PDF’s).\n• The Journeyman would work from home and would ensure proper vehicle maintenance is performed, required parts inventory is maintained, ensure security of Company property to include cell phone, laptop computer, specialty tools and any other item assigned.\nCompensation and Benefits\n• Competitive pay depending on previous experience and current certifications. Overtime is also a factor and is paid at 1.5 X base. We are a performance-based company and pay will ultimately reflect the employee’s productivity and overall performance.\n• Three weeks of paid vacation after 90 days (first year is pro-rated based on start date)\n• Up to 9 paid company holidays\n• Paid sick time (up to one week)\n• Company paid Basic Life Insurance ($75,000)\n• Company paid Short-term and Long-term Disability Insurance\n• Medical, Dental and Vision Insurance\n• A 401K plan\n\nAdditional Info:\n• Criminal background check and pre-employment drug screen are required.\n• This is a remote position and will require the employee to work away from home.\n\nNational Power LLC is an Equal Opportunity/Affirmative Action Employer and VEVRAA federal contractor and affords equal opportunity to all applicants for all positions without regard to race, color, religion, gender, national origin, age, disability, veteran status, gender identification or any other status protected under local, state or federal laws.\n\nPowered by JazzHR\n\nyIgd4L41S8","image":"","location":"Stockton, CA","employmentType":"Dental insurance","datePosted":"16 days ago","salaryRange":"30–40 an hour","jobProviders":[{"jobProvider":"ZipRecruiter","url":"https://www.ziprecruiter.com/c/National-Power,-LLC/Job/Electrical-Journeyman/-in-Stockton,CA?jid=52c6b676dba74224&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Indeed","url":"https://www.indeed.com/viewjob?jk=8cf0ce9837008ddd&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Jobs - JazzHR","url":"https://natpow.applytojob.com/apply/yIgd4L41S8/Electrical-Journeyman?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Jooble","url":"https://jooble.org/jdp/-7762470001214628773?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"LinkedIn","url":"https://www.linkedin.com/jobs/view/electrical-journeyman-at-national-power-3966740900?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Monster","url":"https://www.monster.com/job-openings/electrical-journeyman-stockton-ca--37f49d93-33af-4e10-b966-2d5f9611168d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Glassdoor","url":"https://www.glassdoor.com/job-listing/electrical-journeyman-national-power-llc-JV_IC1147539_KO0,21_KE22,40.htm?jl=1009350763910&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"SimplyHired","url":"https://www.simplyhired.com/job/LGQ_jlNre_h1py0Q_u46KVJoI27bPEjONL8TUm2rZBQiNHrUGxSW7A?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"anlkaGVTc1RzWW54VENxWEFBQUFBQSUzRCUzRCUzQmVsZWN0cmljJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Electric Utility Worker","company":"PG&amp;E Corporation","description":"3.\n8 Stockton, CA Stockton, CA Full-time Full-time $35.\n99 an hour $35.\n99 an hour 1 hour ago 1 hour ago 1 hour ago Requisition ID # 154018 Job Category:\nMaintenance / Construction / Operations Job Level:\nIndividual Contributor Business Unit:\nElectric Operations Work Type:\nOnsite Job Location:\nStockton Department Overview The workers of Electric Operations ensure the delivery of safe and reliable electric service to our customers.\nElectric Operations is responsible for every aspect of PG&amp;E's electric distribution and transmission operations, including planning, engineering, maintenance and construction, asset management, business planning, restoration and emergency response.\nPosition Summary This is an International Brotherhood of Electrical Workers (IBEW) Local 1245 represented classification, which has over 100 years of experience representing employees at PG&amp;E.\nThis job is subject to collective bargaining.\nWe are looking for individuals with basic experience or training in any or... all of the following:\nelectrical and/or mechanical work, high voltage, electrical construction, lineman, carpentry, equipment operations, general construction knowledge and/or physical labor work experience.\nDuties will vary, but could include operation of hand and power tools, assisting apprentice lineman, journeyman lineman, sub-foreman and miscellaneous equipment operators, pulling cable, working with large rotating equipment and loading and unloading material/equipment.\nThe Utility Worker-GC works in variety of environments including remote locations, elevated heights, confined spaces and around bodies of water.\nWorkers may be exposed to poison oak, snakes, spiders, bees, mosquitoes, ticks and rodents.\nThe Utility Worker-GC is a General Construction position and individuals must be able to travel and transfer to a new headquarters upon request at any time; throughout the entire PG&amp;E service territory with no guarantees as to how long you will be away from home.\nTo better represent the communities we serve, applicants who live within 50 miles of the headquarter location will be given preference.\nThis position may be a DOT (Department of Transportation) covered classification and is subject to random drug and/or alcohol screening.\nPG&amp;E is providing the hourly rate that the company in good faith believes it might pay for this position at the time of the job posting.\nThis position is subject to collectively bargained hourly wage rates and increases.\nThe starting wage rate for this position is $35.\n99 per hour.\nThis wage rate is specific to the locality of the job.\nThe wage rate is based on multiple factors, including, but not limited to, specific skills, education, licenses or certifications, experience, market value, geographic location, collective bargaining agreements, and internal equity.\nJob Responsibilities Load and unload equipment, material, job site debris and maintain housekeeping according to PG&amp;E's safety standards and procedures Dig trenches and holes in an ergonomically safe manner Perform construction work in the field, in all weather conditions, throughout the service territory Use and maintain various hand and power tools and equipment Follow the direction of their journeymen and/or supervisor at all times Must be able to read and comply with all required company standards and procedures Must work in a team environment Must work safely at all times as defined by PG&amp;E's safety standards and procedures Qualifications Minimum:\nMust be at least 18 years of age Must possess a High School diploma or GED Must possess and maintain a valid Class C California Driver's License (or higher) by Day 1 of hire Must possess and maintain a valid Class A California Driver's License Permit by within 3 months of hire Ability to work in all types of weather extremes Ability to drive safely in all weather and road conditions Ability to work extended hours, nights, weekends and holidays, and various work schedules Ability to travel and transfer to a new headquarter upon request at any time; throughout the entire PG&amp;E service territory with no guarantees as to how long you will be away from home Ability to work in remote work locations with possible exposure to poison oak, snakes, spiders, bees, mosquitoes, ticks and rodents Must be able to maneuver on steep and/or uneven terrain Ability to work around high voltage, energized and/or large mechanical rotating equipment Must be able to wear company provided Personal Protective Equipment (PPE) Must be able to lift and carry a minimum of 50 pounds over mountainous terrain, dams, canals and/or up stairways and ladders Must be able to work in a confined space and in elevated areas Must be able to perform work tasks from ladders, platforms, metal grating, scaffolds and/or ropes Must be able to work with and/or around bodies of water Must be able to work with and/or around helicopters Desired:\nClass A California Driver's License Electrical troubleshooting Demonstrated experience with basic hand and power tools used in the commercial construction industry Digging/ installing conduit above/below ground Previous physical labor experience Electrical construction experience Military experience Relevant PG&amp;E experience Relevant Hiring Hall experience Graduate from an approved Power Pathway Program Must have a good attitude and to be able to work in a team environment Must be able to receive and understand written and verbal instruction Knowledge of construction and maintenance terminology, processes, and procedures as needed to perform at the job level Knowledge of test and field equipment sufficient to set-up, use, and maintain as needed to perform at the job level To better represent the communities we serve, applicants who live within 50 miles of the headquarter location will be given preference Pre-Employment Testing PG&amp;E Employees:\nYou must have qualified on all prerequisite tests prior to submitting an application; and all secondary tests prior to interviewing.\nFor more information on prerequisite and secondary exams, including study guides, please visit the Pre-employment testing program website.\nPhysical Test Battery Work Orientation Inventory-Physical/Technical Driving Post-Offer Physical Assessment Utility Worker #featuredjob.\nEstimated Salary: $20 to $28 per hour based on qualifications","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQWnp-MWL4Y5QjgS9CIeWIYawaB1J1wdwTNWqSS&s=0","location":"Stockton, CA","employmentType":"Full-time","datePosted":"6 days ago","salaryRange":"20–28 an hour","jobProviders":[{"jobProvider":"Geebo","url":"https://geebo.com/jobs-online/view/id/1338883075-electric-utility-worker-/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"MUY0VjBPX2pTekpuNENob0FBQUFBQSUzRCUzRCUzQmVsZWN0cmljJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Electrician #861- Facilities (Open Until Filled)","company":"Stockton Unified","description":"About the Employer\n\nStockton Unified School District (SUSD) began providing services to students in 1852 and is located in the heart of California's Central Valley near the banks of the San Joaquin River. SUSD is the 17th largest school district in California, whereby 38,000 PK-12th grade students come to us to experience an academic journey that leads to high school graduation and success in... college, careers, and as actively-engaged community members. The District also serves a number of adults through our Stockton School For Adults. SUSD is made up of thirty-seven Head Start classes, fifty-three state preschool classes, three First 5 preschool classes, forty-one K-8 schools, four comprehensive high schools, three small high schools, an alternative high school, a special education school, a school for adults, and five dependent charter schools. Our district mission is to graduate every single youth college, career, and community ready. Stockton Unified School District is dedicated to providing high-quality first instruction, rigorous curriculum, and supporting academic achievement and social-emotional development supported by Multi-Tiered System of Supports (MTSS). The District's work is guided by three focal goals:\n• Every child by the end of third grade will read and comprehend at the proficient level.\n• Every child will have access to high quality, rigorous first instruction.\n• Every child, by the end of 12th grade, will graduate and be college, career, and community ready.\nJob Summary\nJob Summary\n\nSUSD is proud to offer a comprehensive benefit package: -FREE health benefits through Kaiser for Employee and Family - 11 Paid Vacation days - 11 Sick Leave Days - 2 Floating Holidays for 24-25 School Year\n\nJob Description / Essential Elements: Print\n\nBASIC FUNCTION:\n\nReceives general supervision from the Electrical Supervisor to perform journeyperson level skilled electrical work in the repair, alteration, construction, installation, and maintenance of electrical systems and equipment; and perform related duties as assigned. Exercises technical guidance over electrician assistants.\n\nREPRESENTATIVE DUTIES: (Incumbents may perform any combination of the essential functions shown below (E). This position description is not intended to be an exhaustive list of all duties, knowledge, or abilities associated with this classification but is intended to accurately reflect the principle job elements.)\n\nESSENTIAL DUTIES:\n\nInstall, troubleshoot, test and repair of motors, control circuits, conduits and duct systems, light and power circuits appliances, generators, fans, heaters, fixtures, radiant heat boilers, transformers, switchgear, distribution/subpanels, branch circuits, BAS systems for lighting and exhaust fans and fire alarm systems, (E)\n\nAnalyze load size circuits, raceways, and panel capacities and read blue print schematics. (E)\n\nInstall necessary interior and exterior wiring for equipment and appliances. (E)\n\nWire new and altered buildings. (E)\n\nReplace fuses and breakers (E)\n\nInstall, troubleshoot, test and repair fire alarm system. Verify signal and produce alarm receiver signals and reports.\n\nInstall, test, and maintain storage batteries. (E)\n\nAssemble, troubleshoot, repair and replace lighting fixtures and their control systems. (E)\n\nLay out work to be done, calculate loads to provide additional supply of power in compliance with National Electric Code (NEC) and District Standard Specifications. (E)\n\nTroubleshoot, repair and install electric gates systems. (E)\n\nInstall and maintain the electrical distribution supplying power of HVAC equipment. (E)\n\nSupply power and assist with troubleshooting, repairs and testing of elevators, chairlifts and cargo lifts . (E)\n\nTroubleshoot, repair install pumps and clocks for irrigation systems. (E)\n\nTroubleshoot, repair, install and test generators and fire pumps. (E)\n\nAttend advanced training, train other staff (E)\n\nMaintain records on work performed. (E)\n\nMaintain inventory of stock. (E)\n\nDetermine supply needs. (E)\n\nMaintain regular and prompt attendance in the work place.\n\nOTHER DUTIES:\n\nPerform related duties as assigned.\n\nKNOWLEDGE AND ABILITIES:\n\nKNOWLEDGE OF:\n• Standard practices, materials, equipment and tools of the electrical trade;\n• Design, construction, installation, and maintenance of electrical apparatus and equipment together with skill in performing electrical installation and repair work;\n• National Electric Code and the Electrical Safety Orders and Codes of the State of California.\n• Oral and written communication skills.\n• Field Engineering and common construction practice related to the electrical field.\n\nABILITY TO:\n• Make operating repairs to electrical machinery and equipment;\n• Competency in print reading\n• Follow oral and written instructions; work from plans and specifications;\n• Read and write at the level required for successful performance on the job;\n• Diagnose and identify electrical problems;\n• Keep records accurately and neatly;\n• Assist in estimating, job costs, ordering supplies, and keeping inventory;\n• Assist in overseeing the work of electrical contractors;\n• Physical capability sufficient to perform job tasks.\n• Develop and maintain cooperative working relationships with those contacted in the course of work.\n• Carry out oral and written directions; write and speak at a level sufficient to fulfill the duties to be performed for the position described.\n• Operate a computer and knowledge of basic operating programs.\n\nEDUCATION AND EXPERIENCE:\n\nAny combination of education, training and/or experience equivalent to a high school graduation Plus completion of a minimum of four years of classroom and field work in a certified technical school or state indentured apprenticeship program totaling a minimum of six years of experience as a construction and/or maintenance electrician.\n\nLICENSE OR CERTIFICATE\n\nPossession of a valid California driver's license is required.\n\nWORKING CONDITIONS:\n\nENVIRONMENT:\n\nIndoor and outdoor work environment.\n\nRegular exposure to fumes, dust and odors.\n\nAs required must wear protective devices such as earplugs, dust mask, coveralls, gloves, safety boots and safety glasses.\n\nEnclosed work space\n\nPHYSICAL DEMANDS:\n\nEmployee in this position must have/be able to:\n• Lift and/or carry up to 40 lbs at waist height for short distances.\n• Occasionally lift and/or carry up to 94 lbs at waist height for short distances.\n• Occasionally lift 50 lbs overhead for short distances.\n• Dexterity of hands and fingers to operate a variety of trade tools.\n• Walk and/or stand for extended periods of time.\n• See to perform assigned duties.\n• Push/pull up to 100 lbs. at shoulder height.\n• Bend at the waist, kneel, crawl, crouch and stoop.\n• Reach overhead, above the shoulders and horizontally.\n• Climb ladders and work from heights.\n• See, hear and speak with/without assistive devices sufficient to communicate effectively with others.\n\nHAZARDS\n• Working on ladders\n• Fire Alarm Noise\n• Energized Circuitry\n• Working in trenches.\n\nRequirements / Qualifications\nRequirements / Qualifications\n\nAny combination of education, training and/or experience equivalent to completion of one year of responsible journeyman level experience assisting journeyman electricians in the repair, installation and maintenance of electrical systems and equipment.\n\nInterested applicants must submit the following online: 1. A completed online application 2. Letter of interest 3. Resume Please visit our website at: www.stocktonusd.net","image":"","location":"Stockton, CA","employmentType":"Health insurance","datePosted":"21 days ago","salaryRange":"","jobProviders":[{"jobProvider":"ZipRecruiter","url":"https://www.ziprecruiter.com/c/Stockton-Unified/Job/Electrician-861-Facilities-(Open-Until-Filled)/-in-Stockton,CA?jid=2088955d592c2b14&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Talent.com","url":"https://www.talent.com/view?id=d3689057b0fb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"JobServe","url":"https://www.jobserve.com/us/en/extjob/ELECTRICIAN-SHARP861-FACILITIES-in-Stockton-California-USA-5F16470F24C892BC69/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"LifeworQ","url":"https://lifeworq.com/job/4c215ba2-e4fc-4cc6-9e36-8350f86789fd?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"CareerBuilder","url":"https://www.careerbuilder.com/job/J3P81C69RFC8P35ZV75?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"SkillHero","url":"https://app.skillhero.works/opportunities/234852?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"SchoolJobsNearMe.org","url":"https://www.schooljobsnearme.org/jobs/331535323-electrician-861-facilities-open-until-filled-at-stockton-unified?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"JobShark - California Jobs","url":"https://california.jobshark.com/job-in-Stockton-California-USA/ELECTRICIAN-SHARP861-FACILITIES-3d9c75dfedf1d8d157/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"b3RFd29aRDdQeUhsVzNla0FBQUFBQSUzRCUzRCUzQmVsZWN0cmljJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Electrical journeyman","company":"Zero Impact Builders","description":"Benefits :\n• Company car\n• Company car...\n• Dental insurance\n• Health insurance\n\nWHO WE ARE :\n\nWe are an end-to-end Renewable Energy provider, offering products to commercial and enterprise clients in EV Charging solutions, Fleet Electrification, Solar Micro-grids, Energy storage, Hydroponic farming and Rain Water / Grey Water collection systems.\n\nWe have been experiencing tremendous growth in all these areas and operate under several government rebate programs that ensure a steady and reliable flow of revenues.\n\nOur company handles the entire flow of providing these products and services beginning with Sales, Provisioning, Design and Engineering, Contracting and Construction, Servicing and Maintenance.\n\nWe are a licensed C-10 contractor and operate construction crews in various areas of CA and soon the rest of the U.S.\n\nOverview of Position\n• Read and interpret drawings, blueprints, schematics and electrical code specifications to determine layout of electrical equipment installations;\n• Install, examine, replace or repair electrical wiring, boxes, conduits, feeders, Panels, Commercial Switchgear up to 3000A, Transformers Disconnects and other commercial 208 / 480V electrical components;\n• Test electrical equipment and components for continuity, current, voltage and resistance;\n• Maintain, repair, install and test switch-gear, transformers, switchboard meters;\n• Communicating with clients in a professional, courteous manner at all times.\n• Collaborating with construction workers, plumbers, and other crew members.\n• Trenching for electrical underground\n• Test electrical systems using tools that include voltmeters, oscilloscopes and ohmmeters to determine where issues may be occurring, the safety of the system and to ensure compatibility\n• Determine the steps necessary to assess an electrical situation using testing devices, blueprints and maps\n• Maintain a safe work environment by adhering to all company guidelines and OSHA safety requirements and also through reporting violations of policies, procedures and guidelines to immediate supervisor\n• Use ladders, scaffolding, platform and lifts to work on electrical systems in commercial properties.\n• Trench and install underground PVC and overhead EMT\n\nSecondary Functions\n• Interpersonal Skills - Focuses on solving conflict, not blaming; maintains confidentiality; listens to others, is proactive in resolving issues.\n• Written Communication - Write clearly and informatively; conscious of audience and varies writing style accordingly, able to read and interpret written requirements.\n• Contributes to building a positive team spirit\n• Time Management : Prioritizes and plans work activities, uses time efficiently\n• Professionalism At all times\n\nZero Impact Builders is an equal-opportunity employer.\n\nLast updated : 2024-07-12","image":"","location":"Stockton, CA","employmentType":"Health insurance","datePosted":"8 days ago","salaryRange":"27–30 an hour","jobProviders":[{"jobProvider":"Talent.com","url":"https://www.talent.com/view?id=9a7bffcd2d11&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"JoPilot","url":"https://jobs.jopilot.net/job/ZYdMgJABNDRfCFvuD20e0724?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"ZlEyekx2UGZGcjNzVUQ5akFBQUFBQSUzRCUzRCUzQmVsZWN0cmljJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Electrical helper","company":"Synergy Companies Central Valley Location","description":"Synergy Companies is a full service Energy management contractor specializing in residential and small commercial energy upgrade products and services.\n\nSynergy Companies is looking for a new Electrical helper to join our Stockton team. Being a part of the Synergy team allows you to help people in need in your community. You'll have the daily opportunity to help change someone's life by making... their homes more comfortable , safer, and more energy efficient.\n\nWhat you should know about us:\n\nSynergy Companies make a difference in the lives of tens of thousands of people every year by partnering with utility companies throughout the State of California. Each year, millions of dollars are set aside. These dollars are utilized by the utility companies to offer energy - saving series and products to customers throughout California. Synergy Companies is privileged to be a trusted partner with the utilities that get to deliver these no-cost products and services directly to the customer.\n\nResponsibilities :\n• Install and repair electrical equipment and fixtures\n• Install various types of conductors\n• Weather heads\n• Install conduit PVC and EMT\n• Home run circuits / Termination and breaker\n\nQualifications:\n• Experience in retrofitting\n• Familiarity with electrical equipment and hand tools\n• Strong problem solving and critical thinking skills\n\nBenefits:\n• 401k after 1 year of employment\n• Kaiser insurance at no cost for the employee\n• Out of pocket for their dependents ( Discount)\n• Vacation 40hr. per year eligible after 1 year of employment\n• Dental insurance\n• Paid sick time","image":"","location":"Stockton, CA","employmentType":"Dental insurance","datePosted":"5 days ago","salaryRange":"","jobProviders":[{"jobProvider":"Salary.com","url":"https://www.salary.com/job/synergy-companies-central-valley-location/electrical-helper/j202205272124077342751?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Stockton, CA - Geebo","url":"https://stockton-ca.geebo.com/jobs-online/view/id/1354314464-electical-helper-/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Career Cactus","url":"https://careercactus.com/jobs/electical-helper/c2c49e36-2df7-46f1-9a22-7c812181e6d0?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"djN3amZveXBtcm5HVkw2bUFBQUFBQSUzRCUzRCUzQmVsZWN0cmljJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Utility worker","company":"Pacific Gas and Electric Company","description":"Position Summary\n\nWe are looking for an energetic and career oriented individual to join our Energy Delivery, Gas Transmission &amp; Distribution General Construction team...\n\nThe Utility Worker position is an entry level position with advancement opportunities for motivated individuals who perform successfully.\n\nWork is predominantly outdoors and in all weather conditions.\n• The position is a General Construction position and individuals must be able to travel and transfer to a new headquarters upon request at any time;\n• throughout the entire PG&amp;E service territory with no guarantees as to how long you will be away from home. The individual must be able to drive safely, work extended hours;\n\ntravel 100% of the time, and wear company provided Personal Protective Equipment. This position may be in various locations throughout the PG&amp;E service territory that may be in the Northern, Central Valley, or Southern region.\n\nPG&amp;E is providing the hourly rate that the company in good faith believes it might pay for this position at the time of the job posting.\n\nThis position is subject to collectively bargained hourly wage rates and increases. The starting wage rate for this position is $37.\n\n34 per hour. This wage rate is specific to the locality of the job. The wage rate is based on multiple factors, including, but not limited to, specific skills, education, licenses or certifications, experience, market value, geographic location, collective bargaining agreements, and internal equity.\n\nThis position is a DOT (Department of Transportation) covered classification and is subject to random drug and / or alcohol screening.\n\nPer Letter of Agreement R1-22-04-PGE, an employee will be in a 2-year commitment.\n\nJob Responsibilities\n\nGeneral Duties :\n• Must work safely at all times as defined by PG&amp;E’s safety standards and procedures.\n• Follow the direction of their journeyman, crew lead and / or supervisor at all times.\n• Must be able to read and comply with all required company standards and procedures.\n• Must work in a team environment.\n• Must be able to obtain a Class A Driver’s License within 12 months.\n• Must be able to pass Post Offer Physical Assessment.\n• Hand excavate in an ergonomically safe manner.\n• Load and unload equipment, material, job site debris and maintain housekeeping according to PG&amp;E’s safety standards and procedures.\n• Perform construction and maintenance on gas lines and underground electric infrastructure.\n• Maintain tools and equipment.\n• May be required to perform traffic control functions under the direction of a Gas Crew Leader.\n• Ability to pass a medical assessment to wear respirator protection as needed when working around gaseous or hazardous atmosphere.\n• Ability to travel and transfer to a new headquarter upon request at any time; throughout the entire PG&amp;E service territory with no guarantees on how long you will be assigned away from your base headquarters.\n• Contribute toward Gas Safety Excellence goals by improving safety, reliability and\n• affordability for one or more asset families and one or more life cycles.\n• Performs pipe wrapping duties.\n• Assists in construction and maintenance and other miscellaneous semi-skilled work.\n• Performs semi-skilled work assisting a higher classified employee.\n• DOT-Operations / Maintenance AND Emergency\n\nMinimum Qualifications\n• Must be at least 18 years of age.\n• Must possess a High School diploma or GED.\n• Must be able to wear company provided Personal Protective Equipment (PPE).\n• Internal PG&amp;E employees : Must have qualified on the Physical Test Battery (PTB) exam and Work Orientation Inventory Test (WOI), prior to applying for the position.\n• External and Hiring Hall Candidates : Must qualify on the Physical Test Battery (PTB) exam and Work Orientation Inventory Test (WOI), prior to interviewing.\n• Must be able to lift and maneuver up to 90 pounds.\n• Must pass Utility Worker Training course, which takes place for approx. 15 business days, during the first three weeks of employment.\n• Ability to work extended hours to include nights, weekends and holidays when required.\n• Must possess and maintain a valid Class C California Driver's License (or higher) by Day 1 of hire\n• Must possess and maintain a valid Class A California Driver's License Permit by within 3 months of hire\n• Ability to work in all types of weather extremes.\n• Ability to drive safely in all weather and road conditions.\n• Ability to travel and transfer to a new headquarter upon request at any time; throughout the entire PG&amp;E service territory with no guarantees on how long you will be assigned away from your base headquarters.\n\nDesired Qualifications\n• Previous experience in construction such as Underground Utility, Trenching Equipment, Welding, Carpentry, Plumbing, Pipefitting, Farm Ranch Hand and / or Landscaping.\n• Knowledge of Pipeline Coating\n• Previous Military experience.\n• Graduation from a PowerPathway® Program is preferred.\n• Current or past work experience with PG&amp;E and / or Hiring Hall.\n• To better represent the communities, we serve within a timely manner, applicants who live within 50 miles of the headquarter location will be given preference\n\nPre-Employment Testing\n\nPG&amp;E Employees : You must have qualified on all prerequisite tests prior to submitting an application, and all secondary tests prior to interviewing.\n\nFor more information on prerequisite and secondary exams, including study guides, please visit the website.\n• Physical Test Battery\n• Post-Offer Physical Assessment Utility Worker\n• Work Orientation Inventory-Physical / Technical Driving\n\nLast updated : 2024-07-18","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQWnp-MWL4Y5QjgS9CIeWIYawaB1J1wdwTNWqSS&s=0","location":"Stockton, CA","employmentType":"Full-time","datePosted":"2 days ago","salaryRange":"37.34 an hour","jobProviders":[{"jobProvider":"Talent.com","url":"https://www.talent.com/view?id=250bea40cb3a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"SnFCbnloeUhMb2tWZE51dUFBQUFBQSUzRCUzRCUzQmVsZWN0cmljJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Solar electrician","company":"Sunnova Energy International, Inc.","description":"Brief Description of Sunnova\n\nSunnova (NYSE : NOVA) is an industry-leading adaptive energy services company focused on making clean energy more accessible, reliable, and affordable for homeowners and businesses...\n\nAt Sunnova, we embrace diverse perspectives, vibrant creativity and forward-thinkers who share our zeal for a sustainable future.\n\nA career with us means pushing beyond traditional limits, exploring new horizons, collaborating with like-minded peers, and transforming the energy industry for the better.\n\nIf you're excited about being a part of the fastest-growing segment of the energy industry, we encourage you to apply!\n\nSunnova Energy is searching for a Solar Electrician, Install Lead to join our\n\nteam. Sunnova is installing batteries on existing solar systems. The Solar Electrician,\n\nInstall Lead's primary responsibility is installing these additions to meet all standards,\n\nquality, and performance while providing excellent customer service.\n\nThe Solar Electrician, Install Lead must abide by all company safety regulations, be\n\nadaptable, a good communicator, and comfortable working alone with a team and with\n\nhomeowners. They need to be familiar with standard electrical rules and guidelines,\n\nknow how to follow electrical diagrams, maintain vehicle stock and ensure a clean job\n\nsite.\n\nSolar Electrician, Install Lead Responsibilities\n• Installs and maintains battery storage systems and EV chargers according to engineering designs, permits and electrical code\n• Completes site assessments, documenting all necessary information to prepare for an installation\n• Submits service reports immediately following work order completion\n• Collaborates closely with manufacturers and engineering team to resolve technical issues\n• Utilizes knowledge, skills, and electrical testing equipment to commission systems and evaluate system issues\n• Identifies solutions to resolve technical design problems, including electrical systems used during construction\n• Manages vehicle-material stock and equipment inventory\n• Maintains compliance with all Sunnova Safety policies and practices\n• Provides training to customers about system operation and maintenance\n• Manages and resolves customer concerns and issues in a timely manner;\n• communicates and documents progress to customer and relevant Sunnova employees\n• Documents key communications in appropriate Sunnova software\n\nMinimum Requirements\n• High School Diploma (or GED)\n• 1+ years' experience as an electrician, solar installer, or solar maintenance technician\n• Licensed Journeyman Electrician\n• Current, valid Driver's license with acceptable Motor Vehicle Report\n• Proficient in speaking, reading and writing English\n• Working knowledge of the NEC\n\nPreferred Qualifications\n• OSHA 30 Certified\n• Formal apprenticeship and / or vocational training\n• 1 + years' experience in the solar electric industry preferred.\n• 3+ years' electrical experience\n• Bilingual, English and Spanish\n\nAdditional Knowledge, Skills and Abilities\n• Proficiency in Microsoft Office\n• Organized and maintains a professional appearance\n• Strong verbal and written communication skills\n• Reads and interprets blueprints, schematics, and wiring diagrams\n\nWorking Conditions\n• Location varies with job site\n• Estimated 50% overnight travel\n• Driving required; needs valid Driver's license with acceptable Motor Vehicle Record\n• Must be willing to travel for some projects depending on jobsite\n\nPhysical Requirements\n• Long hours spent outside on residential rooftops, driving to customer residences, some ground and rooftop work.\n• Various weather conditions include cold and snowy, hot and humid, and\n• everything in between; must be comfortable working in different environments\n• Must be able to lift and carry up to 50lbs; assistance may be provided for oversized items\n• Must be able to sit, stand, walk, and drive for up to 8 hours at a time\n• Work postures include reaching, kneeling, pushing, pulling, squatting, crawling, bending, twisting, climbing, and handling objects above / below the shoulder\n\nBenefits\n• Sunnova offers a generous employee reward package that includes :\n• Comprehensive benefits, including medical, dental, vision, life insurance, healthcare flexible spending account, and 401(k) with employer match\n• Competitive compensation including overtime\n• Company vehicle provided and Corporate card\n• Paid time off, including 10 holidays and Paid Parental Leave\n• Cell phone allowance for many roles\n• Free access to onsite fitness center in Houston and / or discounted fitness memberships through health provider\n\n$48 - $48 an hour\n\nWe appreciate the capabilities of artificial intelligence (AI), and we are looking to hire real people. If you use AI for any part of the job application process, we highly encourage that you review any AI generated content to ensure your personality and unique capabilities are highlighted.\n\nWe reserve the right to disqualify candidates that we reasonably believe solely relied on AI generated content in the application process.\n\nIf you are selected for a position, your employment will be contingent upon submission to and successful completion of a post-offer / pre-placement drug test (and medical examination if required by the role) as well as pre-placement verification of the information and qualifications provided during the selection process.\n\nLast updated : 2024-07-13","image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSA0uXmzuWpr_TAnS3bxz33V-osg5e0LFmCJZYx&s=0","location":"Stockton, CA","employmentType":"Dental insurance","datePosted":"7 days ago","salaryRange":"48 an hour","jobProviders":[{"jobProvider":"Talent.com","url":"https://www.talent.com/view?id=4deb99a29099&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"Salary.com","url":"https://www.salary.com/job/sunnova/solar-electrician/j202407130204071815118?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"jobProvider":"JoPilot","url":"https://jobs.jopilot.net/job/aIEGsZABNDRfCFvuVvIK0724?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]},{"id":"dFBvVHlZcmg4czUwUEVFTEFBQUFBQSUzRCUzRCUzQmVsZWN0cmljJTIwU3RvY2t0b24lMkMlMjBDYWxpZm9ybmlhJTIwJTIwJTNC","title":"Electrical Apprentice","company":"Tradesmen International","description":"Tradesmen International is currently seeking an Electrical Apprentice in Stockton, CA.\nAs an Electrical Apprentice, you will be responsible for the installation and repair of electrical systems, hydraulic, pneumatic, and electronic components of industrial machinery and equipment under the supervision of a Journeyman Electrician.\nA successful Electrical Apprentice will have...\n- eagerness to learn\n- strong work ethic\n- attention to detail\nTradesmen International offers a benefits package that may include health, dental, vision, life insurance, 401k plan, paid time off and more.\nRegister and apply now.Estimated Salary: $20 to $28 per hour based on qualifications","image":"","location":"Stockton, CA","employmentType":"Dental insurance","datePosted":"2 days ago","salaryRange":"20–28 an hour","jobProviders":[{"jobProvider":"Geebo","url":"https://geebo.com/jobs-online/view/id/346049358-electrical-apprentice-/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}]}]